{
  "computers": [
    {
      "RAM": "Basic Master : 4k",
      "TEXT MODES": "32 x 24",
      "MANUFACTURER": "Hitachi",
      "KEYBOARD": "QWERTY full-stroke keyboard. JIS standard. 56 keys.",
      "description": "\r\nThis early japanese computer seems quite strong with its metal case. The machine has a very sober look. The keyboard is minimalist too, no CTRL or ESC keys...\r\n\n\r\nThere is apparently no graphical high-resolution but the computer offers 253 predefined characters including graphic symbols.\r\n\n\r\nThe power switch is placed on the front case just above the keyboard.\r\n\n\r\nThe Basic Master eventually evolved into the Basic Master Level 2 which offered more memory (8k instead of 4k, wow).\r\n\t\n\n\n",
      "title": "\r\n\t\tMB-6880 / Basic Master and Basic Master Level 2\r\n\t\t",
      "SIZE / WEIGHT": "42.5 × 28.5 × 8 cm / 4kg",
      "TYPE": "Home Computer",
      "SOUND": "Speeaker (5bit D/A converter)",
      "ROM": "16 kb",
      "CPU": "Motorola 6800 (HD 46800)",
      "GRAPHIC MODES": "32 x 24 (8x8 dots characters)",
      "YEAR": "1978 / 1979",
      "COLORS": "Black & White",
      "image": "hitachi_basicmaster_level2_1",
      "OS": "Built-in Basic",
      "BUILT IN MEDIA": "Optional Digital Tapes",
      "I/O PORTS": "Tape (300 bauds) , Audio out",
      "PRICE": "Basic Master :118000 yens",
      "NAME": "MB-6880 / Basic Master and Basic Master Level 2",
      "id": 1,
      "ORIGIN": "Japan",
      "SPEED": "750 Khz."
    },
    {
      "PERIPHERALS": "Tape-recorder, printer interface board, light-pen, Chinese character ROM board, 8088 CPU board, Disk Interface board, Z80 CPU board, RAM expansion boards",
      "RAM": "48k ?",
      "BUILT IN LANGUAGE": "Hitachi Level-3 Basic Version 1.0 (Copyright Microsoft)",
      "TEXT MODES": "80 x 28 / 40 x 25",
      "MANUFACTURER": "Hitachi",
      "KEYBOARD": "QWERTY full-stroke keyboard, separated numeric keypad, 5 function keys",
      "description": "\r\nThis japanese computer seems quite powerful. The main board is located into the main case, under the monitor.\r\n\n\r\nInside this main case there are 6 expansion slots which is quite enough ! Thus a lot of expansion boards were available (disk, printers, 8088, Z80 boards, etc).\r\n\n\r\nAn interesting feature is that there's a little trap-door on the keyboard which reveals some cool control switches : a power switch, a text mode switch (80 / 40 columns), a reset button and volume control knob. Quite useful !\r\n\t\n\n\n",
      "title": "\r\n\t\tMB-6890 / Basic Master Level 3\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "Unknown",
      "ROM": "24k (Basic Interpreter)",
      "CPU": "Motorola 6809",
      "GRAPHIC MODES": "80 x 100 / 160 x 100 / 160 x 200 / 320 x 200 / 640 x 200",
      "YEAR": "1980",
      "COLORS": "8",
      "image": "hitachi_mb6890_2",
      "VRAM": "16k",
      "POWER SUPPLY": "Built-in PSU",
      "I/O PORTS": "6 expansion slots, RS232c, Tape-recorder",
      "NAME": "MB-6890 / Basic Master Level 3",
      "id": 2,
      "ORIGIN": "Japan",
      "SPEED": "1 Mhz"
    },
    {
      "RAM": "22 KB (8 KB left for user, 14 KB for video), up to 38 KB (22,7 KB left for user)",
      "BUILT IN LANGUAGE": "None. Basic 1.0 (Microsoft Basic 5.0) available on cartridge",
      "TEXT MODES": "40 x 25",
      "MANUFACTURER": "Thomson",
      "KEYBOARD": "Flat membrane keyboard, 58 keys. Arrow keys.",
      "description": "\r\nThe \nThomson TO 7\n is the first micro computer conceived by Thomson and the first French micro-computer. This computer, also called \nThomson 9000\n was mainly used in french schools and had somehow a great success in France. \"TO\" stands for \"Tele Ordinateur\" (ordinateur meaning computer in French).\r\n\n\r\nOne of the most interesting feature of the TO-7 is its light pen. Indeed, there is one stored in a small trap above the keyboard. A wide range of software used this device. Even on later Thomson systems (MO and TO series), the light pen is still available as an option. It was the distinctive sign of the Thomson micro-computers.\r\n\n\r\nOn the other hand, its flat membrane keyboard (like the \nZX 81\n's one) is awful! It is impossible to type something quickly. Each stroke is signaled by a small beep. There is a key labeled RAZ (Remise A Zero) which clears the screen, like the classic CLS command... There is a also a ACC key (Accent) which enables accentuated letters.\r\n\n\r\nWhen you switch on the computer, there is no language, just a small configuration tool to test the light pen. The Basic 1.0 (Microsoft Basic 5) is delivered on a cartridge. It inserts into the cartridge trap door on the left side of the keyboard. The cartridges are called \"Memo 7\". Sadly, the trap door locking system is not very secure, and all TO 7 owners experienced the lost of their programs when the trap door opened itself without prompting... When the trap door opens, the cartridge is ejected, and the system hangs. You've lost everything :(\r\n\n\r\nThe Basic is quite complete with useful statements. To do graphics you've got LINE (to draw a line), PSET (to draw points), BOX (to draw a box) and BOXF (to draw a filled box). You can also handle the lightpen with INPEN, INPUTPEN, PEN and ONPEN. The joystick states are read with STICK and STRIG. To do music, you have the PLAY statement, which has been Frenchised. To play the standard note sequence, you would type: PLAY \"DOREMIFASOLASI\"...\r\n\n\r\nAt the back of the computer, one can find 4 expansion slots protected by plastic caps. Three are identical and are used for common expansions like joystick, disk-drives, etc. The fourth one is used by the optional memory expansion. Another item you can't miss at the back of the TO 7 is the BIG heatsink! This thing is huge and was known to cut a lot :( So be careful when you handle a TO 7! It also gets hot fairly quickly, so don't get burn either (man, the TO 7 is dangerous!).\r\n\n\r\nThe first programs (mainly developped by Vifi-Nathan) where really bad, often written in Basic. They were essentialy boring educative games. Despite this bad point, the TO-7 did well thanks to the French National Education who bought a lot of systems to the nationalised Thomson company... And in 1984, the TO-7 was replaced with the \nTO-7/70\n (in fact the TO-7 continued to be sold too for a short time) which corrected the main weaknesses of its little brother.\r\n\t\n\n\n",
      "title": null,
      "SIZE / WEIGHT": "26 x 46 x 8 cm / 3.5 Kg",
      "TYPE": "Home Computer",
      "SOUND": "1 channel, 5 octaves (4 channels, 6 octaves with game expansion)",
      "END OF PRODUCTION": "May 1984",
      "ROM": "6 KB (system monitor) + 16 KB from Memo7 cartridges",
      "CPU": "Motorola 6809",
      "GRAPHIC MODES": "320 x 200 (color attributes on a 8 x 1 pixels matrix)",
      "YEAR": "December 1982",
      "COLORS": "8",
      "image": "thomson_to7_1",
      "VRAM": "14 KB (see above)",
      "POWER SUPPLY": "Built-in PSU, 220v, 50Hz, 30w. There is a protection fuse.",
      "I/O PORTS": "TV output (Scart), Cardridge connector, 3 x expansion connectors, Memory expansion connector, tape-recorder,",
      "PRICE": "562 ",
      "NAME": "TO 7",
      "id": 11,
      "ORIGIN": "France",
      "SPEED": "1 MHz"
    },
    {
      "PERIPHERALS": "Printer interface, Game expansion (2 joystick connectors + enhanced sound), Superimpose expansion, Quick Disk Drive expansion, Disk drives",
      "RAM": "32 KB (31008 bytes free)",
      "BUILT IN LANGUAGE": "Microsoft Basic 1.0",
      "TEXT MODES": "40 chars x 25 lines",
      "MANUFACTURER": "Thomson",
      "KEYBOARD": "AZERTY, calculator type (rubber keys), 58 keys. Arrow keys, SHIFT (yellow key), BASIC key, INS (insert), EFF (delete), ACC (accent), STOP, CNT (continue), CLEAR (cls), HOM (home), RESET button",
      "description": "\r\nThe MO-5 was presented alongside the \nTO 7/70\n, in march 1984. While the TO-7/70 follows and enhances the \nTO-7\n philosophy, the MO-5 is more a cut-down version of the TO-7/70. The idea was to design a coherent french home computer, able to compete with such systems as the \nZX Spectrum\n or the \nCommodore 64\n.\r\n\n\r\nThe case of the MO-5 is elegant with its anthracit colour and pleasant lines. The keyboard, though made of rubber keys, is an improvement over the flat membrane keyboard of the TO-7. Most BASIC statements are engraved onto the keys and can be directly entered by pressing a special BASIC key and the key matching the desire statement. But the Basic commands can also be typed in letter by letter. The keyboard layout is AZERTY which is normal as the MO-5 is a french system. Accentuated letters can directly be accessed by pressing the ACC key, followed by the desired key (6 for é, 7 for è, 8 for ù, 9 for ç and 0 for à). There are also four arrow keys, INS to insert a space, EFF to delete the pointed character, STOP to pause a program, CNT to resume a program stoped and RAZ (remise à zéro) to clear the screen.\n\n\n\n\n",
      "title": null,
      "SIZE / WEIGHT": "29 (W) x 18,3 (D) x 5 (H) cm",
      "TYPE": "Home Computer",
      "SOUND": "One channel, 5 octaves (7 octaves, 3 channels with the joystick extension)",
      "ROM": "16 KB (4 KB for the monitor + 12 KB for the BASIC interpreter)",
      "CPU": "Motorola 6809e",
      "GRAPHIC MODES": "320 x 200 dots",
      "YEAR": "March 1984",
      "COLORS": "16",
      "image": "thomson_mo5_1s",
      "VRAM": "16 KB",
      "POWER SUPPLY": "External power supply unit, 220 volts / 50 Hertz / 12-17 volt / 750 mA",
      "I/O PORTS": "Light pen connector, Tape interface (1200 bauds), SCART (SECAM) video output (RGB + synchro + sound), Cartridge slot (Memo5), Expansion bus",
      "PRICE": "541 ",
      "NAME": "MO 5",
      "id": 12,
      "ORIGIN": "France",
      "SPEED": "1 MHz"
    },
    {
      "RAM": "128 KB (up to 1MB)",
      "BUILT IN LANGUAGE": "V.T. version of AppleSoft BASIC",
      "TEXT MODES": "40 / 80 x 24 (monochrom)",
      "MANUFACTURER": "Video Technology",
      "KEYBOARD": "Full-stroke 91 keys with numeric keypad and arrow keys",
      "BUILT IN MEDIA": "Built-in 5.25 floppy disc drive",
      "CO-PROCESSOR": "3 x V.T. custom chips",
      "title": "\r\n\t\tLASER 128 / 128EX / 128EX2\r\n\t\t",
      "SIZE / WEIGHT": "38 (W) x 32.5 (D) x 7.7 (H) cm.",
      "TYPE": "Home Computer",
      "SOUND": "Built-in speaker",
      "ROM": "192 KB",
      "CPU": "65C02",
      "GRAPHIC MODES": "All the Apple IIc modes, with an extra set for RGB: 40 x 48 / 80 x 48 / 280 x 192 / 560 x 192. 4 lines of text mode can be mixed with a truncated the 40 x 48 and 280 x 192 modes.",
      "YEAR": "1988",
      "COLORS": "16 (40 - 80 x 48)  / 6 (280 x 192) / 16 (560 x 192)",
      "image": "videotech_laser128ex_system_1",
      "VRAM": "64 KB",
      "OS": "DOS 3.3",
      "description": "\r\nThe Laser 128 EX is the successor of the \nLaser 3000\n. Like the 3000, it is fully compatible with the \nApple II computer\n, but has enhanced features.\r\n\n\r\nVideo Technology designed its own Apple II compatible ROM (Apple lost a lawsuit challenging it), this ROM holds an Applesoft compatible version of the BASIC.\n\r\nThe \"Open Apple\" and \"Closed Apple\" keys have been replaced with \"Open Triangle\" and \"Closed Triangle\" keys.\r\n\n\r\nThe 128EX/2's Video Display Generator chip also provided both analog RGB video (for connecting an \nApple IIGS\n, \nAmiga\n, or \nAtari ST\n monitor) and digital RGB video (for connecting a CGA monitor).  In RGB mode, the Video Display Generator (VDG) chip generates a text character set identical to an IBM PC (with the addition of the Open and Closed Triangle characters)\r\n\n\r\nThe drive and the external daisy-chainable SmartPort floppy drive is driven by Video Technologies custom \"Universal Disk Controller\" (UDC) disk array chip. The SmartPort supports Apple \nIIe\n/\nIIc\n UniDisks (3.5\" and 5.25\" models), \nMacintosh\n 3.5\" drives (the ones without the buttons), Apple IIGS daisy-chainable 3.5\" drives and Apple 5.25\" disks. It is also designed to support the Chinook CT-series 20 MB to 100 MB SmartPort hard drives. The SmartPort can support two 800K 3.5\" drives, two 140K 5.25\" drives, and one 100 MB CT100 hard drive simultaneously daisy-chained to each other.\r\n\n\r\nThe  Apple bus compatible expansion slot can hold an Apple High Speed (DMA) SCSI controller for running additional SCSI based storage devices.\r\n\n\r\nThis unit was so successful that Apple Computers was prompted to upgrade the IIc to counter it. The result was the Apple IIc Plus, also released in 1988. The IIc Plus had a 4 Mhz Western Design Center 65C02 processor, an 800K 3.5\" drive built-in, and an External Drive \"SmartPort\" capable of the same tricks as the Laser's.\n\r\nAlthough the two units were similarly matched, Video Technology actively advertised the Laser 128EX/2 while Apple had moved on to promoting the Macintosh.\r\n\n\r\nThe Laser became the most successful Apple II clone ever and this model was 99.8% IIc Plus compatible. The only two pieces of software the Apple magazines reported as incompatible were The New Print Shop (Brøderbund Software) and HomeWord (Sierra).\r\n\n\r\nIn North America, the Laser was aggressively marketed in Sears department stores, where it eroded its niche rival's sales, the Commodore 128.\r\n\n\r\nThis Laser unit's case was also used to make a Turbo XT PC clone. The PC clone and the Laser 128EX/2 shared the same case. They looked identical except for the label. Instead of \"Laser 128EX/2,\" the XT had \"Laser XT10\"\r\n\n\r\nLater, Video Technology also had a line of PC machines ranging from an XT 10 MHz, three 80286 versions, a failed 386 and a very robust but expensive 486 before they stopped making them and went back to electronic toys.\r\n\t\n\n\n",
      "POWER SUPPLY": "External power supply (15V dc, 12A, 18w)",
      "I/O PORTS": "RS232 (2), MIDI, Centronics, Tape, Composite, LCD output (for flat panel display), RGB, External Drive",
      "PRICE": "About $700",
      "NAME": "LASER 128 / 128EX / 128EX2",
      "id": 13,
      "ORIGIN": "Hong Kong",
      "SPEED": "3.6 MHz"
    },
    {
      "PERIPHERALS": "Memory expansion, Graphical board, printer, hard-disk, mouse",
      "RAM": "64 KB (Z80) + 128 KB (8086)",
      "TEXT MODES": "80 x 25 / 40 x 25",
      "MANUFACTURER": "Xerox",
      "KEYBOARD": "Full-stroke keyboard with numeric and editing keypads, arrow keys, 12 function keys",
      "description": "\r\nThe \"best of both worlds\". The Xerox 8 / 16 belongs to a family which appeared at the end of the 8 bit era, when MS-DOS began to be a standard for the 16-bit systems. It has two CPUs, the Z80 allows the use of CP/M and the 8086 is for MS DOS and CP/M 86. This computer was actually two computers sharing certain resources, like the display, the power supply and the floppies but essentially seperate.\n\r\nThis computer was one of the first, if not the first PC-sized computer that had concurrent processing (not time share, but real honest to goodness concurrent processing). One could start a task on either operating system, say a spread sheet, and then hot key over to the other processor and perform another task, all while the other \"side\" was working at full speed at it's task. Because the 16/8 was actually two computers in one, both sides worked at full capacity and did not share ram or other system resources required for processing data: they worked at full speed regardless of whether or not the other side was in use. Only the \"active side\" had access to the video, floppies and the hard drive (if avaialble), but with dual floppies, one floppy could be assigned for the 8 bit side and one for the 16 bit side. In that instance, each side would access the its assigned floppy when brought to the active side. \r\n\n\r\nThe 16/8 is made of four units :\n\r\n- a 12'' monochrom monitor, housing the whole hardware of the system, like in the Apple Macintosh,\n\r\n- the keyboard, very complete,\n\r\n- the disks (two 5''1/4 disks, a hard-disk (5 MB, later 10 MB) was optional),\n\r\n- an expansion box meant to house the different expansion boards.\r\n\n\r\nThere was also a Diablo printer in option. The whole system thus took quite some room on your desktop!\r\n\n\r\nAfter the presentation of the first 16/8 in 1983, Xerox launched a new version in 1984, faster, more compact and sold with a hard-disk.\r\n\n\r\nUnfortunately the 16/8 was a bit obsolete as the 8-bit professional systems were dying slowly and the 16/8 wasn't offering much more than an IBM PC launched a few years before. The price of the system wasn't even attractive.\n\r\nXerox stopped the production of all its micro-computers at the start of the year 1985.\r\n\n\r\nThis computer is the direct successor of the \nXerox 820 series\n, which could be almost converted into a Xerox 8/16 with a special 8086 board.\r\n\n\n\nDale Carpenter\n adds:\n\r\nSeveral things, an 820-II has an extra expansion slot on the motherboard. if you put the 16-bit card into that slot your 820-II is now a 16/8.\n\r\nYour picture shows a rectangular box called an EM-II (expansion module - II) to add it to a 16/8 you remove the 16-bit card and install it in the card cage in the center of the EM-II then install the card with 2 wide ribbon cables attached(coming from the EM-II) into the expansion slot on the motherboard.\n\r\nThe EM-II has either 1 hard drive, 1 floppy or 1 of each. The system supported the external drives also, the dual 5.25\" and 8\" boxes.\n\r\nOne final note not mentioned: all of the 8\" drive boxes had an expansion plug on the back you could daisey chain up to 4 drive units onto any of the 820, 820-II and 16/8 machines.\n\n\n\r\n___________\r\n\n\n\nThanks to chrism3667 for the picture\n\n\n\n\n",
      "title": "\r\n\t\t8 / 16\r\n\t\t",
      "TYPE": "Professional Computer",
      "SOUND": "Beeper",
      "END OF PRODUCTION": "1985",
      "ROM": "4 KB Bootstrap",
      "CPU": "Zilog Z80A @ 4 Mhz (8-bit)",
      "GRAPHIC MODES": "640 x 256",
      "YEAR": "1983",
      "COLORS": "Unknown",
      "image": "xerox_8_16_2",
      "OS": "CP/M (8bit), CP/M 86 (16bit, MSDOS optional)",
      "BUILT IN MEDIA": "One or Two 5.25'' or 8'' disk-drives",
      "POWER SUPPLY": "PSU built-in",
      "I/O PORTS": "Serial 9600 bauds, Internal Expansion Slot, External Floppy Connector",
      "PRICE": "from 4575 ",
      "NAME": "8 / 16",
      "id": 14,
      "ORIGIN": "U.S.A.",
      "SPEED": "4 Mhz (Z80A) and 4,77 Mhz (8086)"
    },
    {
      "PERIPHERALS": "Printers, additional disks",
      "RAM": "64 kb",
      "BUILT IN LANGUAGE": "Basic 80 delivered on disk",
      "TEXT MODES": "80 x 24",
      "MANUFACTURER": "Xerox",
      "KEYBOARD": "AZERTY/QWERTY, full-stroke keyboard with separated keyboard",
      "description": "\r\nThe Model 820 is an attempt from Rank Xerox to enter the professional micro-computer market. But the 820 is a bit weak with its Z80 at only 2,5 Mhz and its 96kb 5''1/4 disk-drives (83k formated). Fortunately higher capacity 8'' disk-drives were also available (300 kb each). Apparently a 10Mb hard-disk was also proposed.\r\n\n\r\nThe communication was focused on the fact that the Xerox 820 could suit to a lot of professions, and indeed, thanks to its CP/M compatibility a lot of different software was available (Wordprocessor, Supercalc, AGIS billing, SAARI, Wordstar 3.0, Mailmerge 3.0, Supersort 1.6, Calcstar, Infostar 1.0, FIGARO hair-dresser management, etc...). \r\n\n\r\nThe Xerox 820 was followed by the \nXerox 820-II\n.\r\n\n",
      "title": "\r\n\t\t820\r\n\t\t",
      "SIZE / WEIGHT": "Main unit/monitor : 32,8 x 38,1 x 34,3 cm / 13,6 kg",
      "TYPE": "Professional Computer",
      "SOUND": "Unknown",
      "END OF PRODUCTION": "1985",
      "ROM": "from 4 kb to 8 kb",
      "CPU": "Zilog Z80 A",
      "GRAPHIC MODES": "Unknown",
      "YEAR": "1981",
      "COLORS": "Black and white 12'' monitor",
      "image": "xerox_820_system_s1",
      "OS": "CP/ M 2.2",
      "BUILT IN MEDIA": "One or two 5.25'' disk-drives (80 KB formatted each)",
      "POWER SUPPLY": "Built-in PSU",
      "I/O PORTS": "Serial 9600 bauds, Internal Expansion Slot, External Floppy Connector",
      "PRICE": "With double 8'' disks = 3900 ",
      "NAME": "820",
      "id": 15,
      "ORIGIN": "U.S.A.",
      "SPEED": "2,5 Mhz"
    },
    {
      "RAM": "64 KB",
      "TEXT MODES": "five text modes, max: 40 x 24, min: 20 x 12",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Full stroke keyboard + function keys",
      "CO-PROCESSOR": "GTIA (video output, sprites), POKEY (sound, I/O), ANTIC (video, display lists)",
      "title": null,
      "TYPE": "Home Computer",
      "description": "\r\nThe Atari 1200 XL was the predecessor of the \nAtari 600/800 XL\n. It had much of the same characteristics, except the size of its ROM (16 KB instead of 24 KB) the BASIC Interpreter being supplied on a cartridge. Because the built-in Operating System was not designed very well, people are known to have swapped the OS ROM chip from their 800XL & put in the 1200 XL.\r\n\n\r\n This machine was a flop in the marketplace and would be produced for only 4 months before being replaced with the 600 & 800 XL machines. This computer was not distributed in Europe.\r\n\n",
      "SOUND": "four channels, 3.5 octaves",
      "ROM": "16 KB (the Basic is on a cardridge)",
      "CPU": "MOS 6502C",
      "GRAPHIC MODES": "12 graphic modes, maximum : 320 x 192",
      "YEAR": "1982",
      "COLORS": "16 colors with 16 intensities",
      "image": "atari_1200xl_system_system_2",
      "BUILT IN MEDIA": "None",
      "POWER SUPPLY": "External power supply unit",
      "I/O PORTS": "Monitor (RGB) video output, RF TV output (to switchbox), Cartridge slot, Peripheral connector, 2 x Joystick connectors",
      "PRICE": "$599.99 (USA,  June 1983)",
      "NAME": "1200 XL",
      "id": 16,
      "ORIGIN": "U.S.A.",
      "SPEED": "1.79 MHz"
    },
    {
      "PERIPHERALS": "Various Tandy peripherals",
      "RAM": "16 KB (up to 48 KB)",
      "BUILT IN LANGUAGE": "TRS-80 Level II BASIC",
      "TEXT MODES": "32 or 64 columns x 16 lines",
      "MANUFACTURER": "Tandy Radio Shack",
      "KEYBOARD": "Full-stroke keyboard with separated numeric keypad",
      "description": "\r\nThe model 3 is generally regarded as the successor to the \nModel 1\n. \r\nIts two 5.25\" floppy disk drives could convert model 1 disks.\r\n\n\r\nInitially Radio Shack wanted to sell both the model 1 and 3 at the same time, but the FCC forced them to stop selling model 1. Is so they were discontinued because of the excessive radio noise that they put out.\r\n\n\r\nHowever, the Model 3 wasn't FULLY compatible with the model 1.  There were differences in ROM which meant some programs had to be converted, especially those machine language ones that made ROM calls.\r\n\n\r\n______________________\r\n\n\r\nModel III configurations, by \nDave Thompson\n:\n\n\nTRS-80 Model III was sold in multiple configurations.\n\r\nNo hardrive configurations included:\n\r\nModel III with Level 1 ROM, 8k RAM sold for US$799.  Model III with Level 2 ROM, 16k RAM sold for $999.\n  \r\nThe first floppy drive cost $849, and could store 168k. The second drive was cheaper, and could store more. The price difference is due to the first one included the drive controller. The increased space on the second drive (189k) was due to the first drive must also contain some TRS-DOS (the operating system).\n\n\n\n\nBrandt Daniels\n adds:\n\n\n\r\nThere was also a TRS-80 VideoTex Computer terminal in 1980.\n\n\n\n\nMark Fowler\n reports:\n\n\nI worked for a company in 1982 that had integrated a 5MB, and later a 10MB hard disk into the TRS80 Model III.  It was then programmed in FORTRAN-66 as a dedicated medical records system, to mimic the pegbook accounting system in use in the 1980's. We introduced green phosphor, and later amber phosphor display tubes. Some systems were used with a modem to do simple email-type applications, and to access various bulletin boards.\n\n\n\n\n",
      "title": "\r\n\t\tTRS 80 MODEL III\r\n\t\t",
      "TYPE": "Home Computer",
      "END OF PRODUCTION": "Unknown",
      "ROM": "14 KB",
      "CPU": "Zilog Z80 then Z80A",
      "GRAPHIC MODES": "128 graphic characters",
      "YEAR": "1981",
      "COLORS": "monochrome",
      "image": "tandy_trs80_model3_1",
      "OS": "TRS DOS (other OSes were available : New DOS, LDOS, MultiDOS, ...)",
      "BUILT IN MEDIA": "Zero, one or two 5.25'' disk-drives.",
      "POWER SUPPLY": "Built-in power supply unit",
      "I/O PORTS": "Tape (500 or 1500 bauds), Centronics, RS232",
      "PRICE": "No disk model : AU$1450 (Australia, 1981)",
      "NAME": "TRS 80 MODEL III",
      "id": 18,
      "ORIGIN": "U.S.A.",
      "SPEED": "2.03 MHz"
    },
    {
      "PERIPHERALS": "Most of the standard IBM/PC cards",
      "RAM": "640 KB",
      "TEXT MODES": "40 x 25 / 80 x 25",
      "MANUFACTURER": "Amstrad",
      "description": "\r\nThe Amstrad PC 1640 was the successor to the \nAmstrad PC 1512\n. It had the same characteristics as its predecessor except for added memory (640 KB instead of 512 KB) and the EGA graphics standard.\r\n\n\r\nIt also had great success, but to a lesser extent than the PC 1512. As the PC 1512, the Amstrad PC 1640 came with the GEM graphical user interface, from Digital Research, an alternative to Windows.\r\n\n\r\nThe PC-1640 was marketed under the name PC-6400 in the USA. It was also sold in Germany and maybe some other European countries under the name Schneider. \r\n\n\r\nThree different kinds of monitors where supported, monochrome (-> Hercules), low-res (max 640 x 200) and hi-res (max 640 x 350). The hi-res monitor had a fan for the power supply as opposed to the other monitors which where fan-less. With the low-res monitor you could choose between a full CGA compatible mode (required for many CGA games) and an EGA mode (used for 640 x 200 x 16 eg. for GEM or 320 x 200 x 16 for several games).\r\n\n\r\n________\r\n\n\r\nContributors: André Janz\r\n\n\n\nCharles Da Silva\n adds:\n\r\nThe 1640 was first introduced in the US and after a few months in Europe (which infuriated the British media, some of them having already been harsh critics on the 1512 : fan problems - forgetting that since the PSU was in the monitor, it was not needed - not 'fully' compatible as it was then thought. All of this proved to come from IBM itself, which made Alan Sugar really angry).\n\r\nYou can find all this info in 'Alan Sugar' from late D. Thomas.\n\n\n\n\nEx Cathedra's\n memories:\n\r\nI did a large amount of development on these machines in the late 80s. They were surprisingly good, with only a few bugs and incompatibilities with the IBM PC standard. Bearing in mind the price differential, we had no problems living with these.\n\r\nThe RTC and BIOS settings were preserved by 4xAA batteries under the monitor - a configuration I wish we still had today! There was a minor (patchable) bug in the BIOS which caused a div/0 error at midnight each night if you'd left it running a long compilation...\n\n\n\n\n",
      "title": "\r\n\t\tPC 1640\r\n\t\t",
      "TYPE": "Professional Computer",
      "SOUND": "Beeper",
      "ROM": "64 KB",
      "CPU": "Intel 8086",
      "GRAPHIC MODES": "All EGA graphic modes (maximum : 640 x 350)",
      "YEAR": "1986",
      "COLORS": "16 among 64",
      "image": "amstrad_pc1640",
      "VRAM": "256 KB ?",
      "OS": "MS DOS 3.2",
      "BUILT IN MEDIA": "one or two 5.25'' disk-drives, 20 or 30 MB HDD",
      "POWER SUPPLY": "PSU built-in",
      "I/O PORTS": "Four 8-bit ISA slots (one being reserved of the internal HD controller), Centronics, RS232c, Mouse port (proprietary)",
      "NAME": "PC 1640",
      "id": 19,
      "ORIGIN": "United Kingdom",
      "SPEED": "8 mHz"
    },
    {
      "RAM": "512 KB (520 ST/STM), 1 MB (520 ST+)",
      "TEXT MODES": "40 or 80 columns x 25 lines",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Full-stroke keyboard with numeric and editing keypads",
      "CO-PROCESSOR": "'Shifter' and 'Glue' custom chips",
      "title": "\r\n\t\t520 ST / ST+ / STM \r\n\t\t",
      "SIZE / WEIGHT": "47 (W) x 24 (D) x 6 (H) cm",
      "TYPE": "Home Computer",
      "description": "\r\nThe 520 ST featured same hardware basis and same amount of memory as the \n260 ST\n.\r\n\n\r\nThe main difference between them was the built-in ROM TOS operating system and GEM Graphics Interface. In fact, the Atari 520ST originaly came with the OS on floppy as the OS was not completly finished.  Very shortly afterward they came with the OS on 6 ROM chips (TOS 1.0).\r\n\n \r\nIt was first sold in Germany where it met a great success then released in the United States about six monts later. Colour and monochrome version were available. Sadly, users of the colour version couldn't expect programs written for the monochrome version to work until someone wrote an emulator allowing the software written for the monochrome version to run on a colour monitor.\r\n\n\r\nAtari was the first company to offer built-in MIDI ports.  This made the computer very popular with musicians.  One game even used the MIDI conectors (Midi Maze) to connect up to 16 computers together in a MIDI network.\r\n\n\r\nThe \n520 ST+\n offered 1 MB of RAM instead of 512 KB. As the main board was designed to provide space for only 512 KB of RAM (16 x 41256 type chips), the second 512 KB bank chips were soldered on top of the original chips.\r\n\n\r\nApparently, 1 Mb versions were sold as Atari 1040s in Australia...\r\n\n\r\nThe model \n520 STM\n came with a built-in TV modulator allowing a direct connection with the TV-set. \r\n\n\r\nThe original Atari 520 ST came with an external  360K single sided 3.5 floppy drive, the SF354. Most dealers either bundled it with separate power supply, or a much neater Cumana or Triangle branded drive at lower cost.\r\n\n",
      "SOUND": "3 voices, 8 octaves",
      "ROM": "192 KB",
      "CPU": "Motorola MC68000",
      "GRAPHIC MODES": "320 x 200 / 640 x 200 / 640 x 400 dots",
      "YEAR": "1985",
      "COLORS": "16 among 512 (320 x 200) / 4 among 512 (640 x 200) / monochrome (640 x 400) this last mode needs a special monitor.",
      "image": "atari_520st_system_1",
      "OS": "TOS / GEM",
      "BUILT IN MEDIA": "External 3.5'' 360 KB disk-drive (option)",
      "POWER SUPPLY": "External power supply unit",
      "I/O PORTS": "RGB, TV modulator (520STm), Cardridge, Midi (in/out), Centronics, RS232c, Hard Disk, Floppy Disk, Joystick, Mouse",
      "PRICE": "£749 (1985, UK),  £399 (1986, UK)",
      "NAME": "520 ST / ST+ / STM",
      "id": 20,
      "ORIGIN": "U.S.A.",
      "SPEED": "8 mHz"
    },
    {
      "RAM": "130-XE : 128 kb",
      "BUILT IN LANGUAGE": "Atari Basic",
      "TEXT MODES": "Five text modes, maximum : 40 x 24",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Full-stroke keyboard, 57 keys, 5 function keys (Help, Start, Select, Option, Reset)",
      "CO-PROCESSOR": "GTIA (video), POKEY (Sound, I/O), ANTIC (Video), FREDDY (memory)",
      "title": "\r\n\t\t65 / 130 XE\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "4 channels, 3.5 octaves",
      "ROM": "24 kb",
      "CPU": "MOS 6502C",
      "GRAPHIC MODES": "11 graphic modes, maximum : 320 x 192",
      "YEAR": "1985",
      "COLORS": "16 colors with 15 intensity level each",
      "image": "atari_130_xe",
      "description": "\r\nThe Atari 130-XE was first shown at the Winter Las Vegas Consumer Electronic Show in 1985 (with the \nAtari 130 ST\n), it has the same characteristics as the \nAtari 800 XL\n except its added memory (128 KB instead of 64 KB for the 800 XL).\r\n\n\r\nThe extended memory can be used as a RAM disk, or can be accessed by bank switching routines.\r\n\n\r\nIt was an attempt to extend the life of the old XL series, but Atari abandoned it pretty quickly to concentrate on promoting the ST series, which uses the same case style.\r\n\n\r\nSeveral XE machines were also produced : \n\r\n- the Atari 65-XE (which is exactly like the 800 XL, except for the rear parallel connector, which it doesn't have),\n\r\n- the Atari XE Game Console (1987) which is a 65-XE with an optional detachable keyboard. It was Atari Corp.'s attempt to do what they felt the 5200 should have been.\r\n\n\r\n- the \n65-XEM\n (a computer with a special custom sound chip called \"Amy\"). Reports stated that the Amy chip sounded better than the \nCommodore 64\n's SID chip (!). This machine would never be released, \n\r\n- the \n65-XEP\n (Atari's answer to the Commodore SX-64, it would never be released either),\n\r\n- and a modified 65XE was sold in Europe as the 800XE.\r\n\n\r\nThe Atari 65-XE and 130-XE will have a very short life due to the 16 bit home computer competition.\r\n\n\r\n_________\r\n\n\n\nJesse\n comments:\n\n\nThe XEGS differed from the 65XE in another way:  It had the game Missile Command built in.  If you held Select key down (maybe it was Start or Option) when turning on the machine, Missile Command would start.\n\n\n\n\n",
      "POWER SUPPLY": "External power supply unit (1A, 5v cc)",
      "I/O PORTS": "Composite video output, Cardridge port, Expansion port, SIO peripheral port (tape, disk, printer, modem), 2 x joystick connectors",
      "NAME": "65 / 130 XE",
      "id": 21,
      "ORIGIN": "U.S.A.",
      "SPEED": "1.79 MHz"
    },
    {
      "RAM": "64 KB",
      "TEXT MODES": "five text modes, max: 40 x 24, min: 20 x 12",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Full-stroke keyboard, same as 1200xl",
      "CO-PROCESSOR": "GTIA (video output, sprites), POKEY (sound, I/O), ANTIC (video, display lists), FREDDY (memory manager)",
      "title": "\r\n\t\t1450 XLD\r\n\t\t",
      "SIZE / WEIGHT": "Unknown",
      "TYPE": "Home Computer",
      "description": "\r\nThe Atari 1450 XLD has the same characteristics as the \nAtari 1400 XL\n.\r\n\n\r\nLike the 1400 XL, it has a built-in modem (Bell 103 compatible, 300 baud) and the speech synthesiser chip (SC-02). Contrary to the other Atari, it uses a parallel disk drive controller (a much faster arrangement) instead of the SIO interface.\r\n\n\r\nApparently The 1450 was not released because they were having problems getting the parallel disk drive controller to work properly.\r\n\t\n\n\n",
      "SOUND": "four channels, 3.5 octaves",
      "ROM": "16 KB (the Basic is on a cardridge)",
      "CPU": "MOS 6502C",
      "GRAPHIC MODES": "12 graphic modes, maximum : 320 x 192",
      "YEAR": "1982",
      "COLORS": "16 colors with 16 intensities",
      "image": "atari_1450_xld",
      "OS": "ROM Based",
      "BUILT IN MEDIA": "One or Two 5.25'' FDDs",
      "I/O PORTS": "RGB, cartridge, Expansion port, Tape, RS232, Joystick",
      "NAME": "1450 XLD",
      "id": 22,
      "ORIGIN": "U.S.A.",
      "SPEED": "1.92 MHz"
    },
    {
      "RAM": "4 x SIMM sockets - From 512 KB up to 4 Mb",
      "TEXT MODES": "40 or 80 chars.  x 25 lines (bitmapped graphics)",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Full-stroke keyboard with editing and numeric keypads",
      "description": "\r\nThe Atari STe is the successor of the \nAtari STf\n (The 'e' stands for 'enhanced') and is almost fully compatible with the STf.\r\n\n\r\nIn september 1986, Atari decided to make a successor to the STf. They planned to equip it with enhanced video features : Atari said then that the STe will have a 640 x 400 with 16 colors among 4096 and a 320 x 200 with 256 colors among 4096 graphic modes. Unfortunately, eventually, the STe will have none of these graphic modes.\r\n\n\r\nThe new features are :\n\r\n- a new version of the OS (\"Rainbow\" TOS 1.6 and later, 1.62),\n\r\n- a Blitter chip to quick perform memory moves (it is the \nthe Mega STf\n one),\n\r\n- the video chip (Shifter) has been enhanced: the STe can perform, as the \nAmiga\n, hardware scrolling in all directions and it is possible to write into the video counters. It also handle 4096 colors instead of 512, unfortunately, it can only display a maximum of 16 of them (without trick).\n\r\n- 'phase lock' of the video output to an external video source permitting direct linking to genlocking device.\n\r\n- It has enhanced sound features too: two 8 bit PCM (Pulse Coded Modulation) channels which can replay stereo sound at 6.25, 12.5, 25, or 50 KHz and which can be mixed with the 3 FM channels.\r\n\n\r\nDespite its new and interesting features, the Atari STe was a flop in the marketplace. The STf market was too important and the software editors (especially game editors) didn't sell STe versions of their products.\r\n\n\r\nNot long after this, Atari launched the \nMega STe\n to replace the \nMega STf\n.\r\n\n\r\nThere was an interesting variation on the STe in the R&D labs of Atari, called the STe+, which had an AMD 286 chip and a small IDE hard drive built in.  Quite why this was abandoned nobody really knows, but a number of working prototypes were found in Atari's Mexico office when Atari finally blinked out of existence and have appeared on ebay from time to time.\r\n\n\r\n_______________________\r\n\n\n\nContributors:\n Malcolm Ramage.\n\n\n",
      "title": "\r\n\t\t520 / 1040 STe\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "3 voices + 1 noise channel, 8 octaves + two 8 bit PCM channels",
      "ROM": "192 KB (256 KB in later versions)",
      "CPU": "Motorola MC 68000",
      "GRAPHIC MODES": "320 x 200 (16 colors) / 640 x 200 (4 colors) / 640 x 400 (monochrome)",
      "YEAR": "1990",
      "COLORS": "4096",
      "image": "atari_1040_ste_with_box",
      "OS": "TOS + GEM",
      "BUILT IN MEDIA": "3.5'' disk-drive",
      "POWER SUPPLY": "Built-in PSU",
      "I/O PORTS": "Cardridge, Midi (in, out), Centronics, RS232c, Hard Disk, Floppy disk, RGB, Joystick, mouse,  2 x analogue controllers, Stereo RCA jacks",
      "PRICE": "520 STE : 396 ",
      "NAME": "520 / 1040 STe",
      "id": 24,
      "ORIGIN": "U.S.A.",
      "SPEED": "8 mHz"
    },
    {
      "RAM": "512 KB (up to 4 MB)",
      "TEXT MODES": "40 or 80 chars.  x 25 lines (bitmapped graphics)",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Full stroke keyboard with numeric keypad, editing keypad and 10 function keys",
      "description": "\r\nThe Atari 520 and 1040 STf were the direct successors of the \nAtari 260 ST and Atari 520 ST\n. In fact, they had the same technical characteristics except from built-in floppy drive (hence the \nf\n of STf).\r\n\n\r\nThe 3.5\" floppy disk drive has been integrated with the power supply into the computer. The early first versions of the Atari 520 STf had a RAM based Operating System (they have a 32 KB ROM), this ROM will be quiclky replaced by a 192 KB ROM which holds all the operating system (called TOS 1.0).\r\n\n\r\nAn enhanced version of the Atari 520 STf was launched a few months later : the \nAtari 1040 STf\n to replace the Atari 520+ : It also had the same characteristics as the 520 STf except its memory (1 MB instead of the 512 KB) and the floppy disk drive : it used 3.5\" double side disks (720 KB).\n\r\nNot long after the launch of the 1040 STf, the 520 STf would be \"unofficially\" equipped with 720 KB floppy disk drives.\n\r\nThere was also a \nSTfM\n model with a built-in floppy (the f) and an RF Modulator (the M).\n\n\n\n\n",
      "title": "\r\n\t\t520 / 1040 STf / STfm\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "3 voices + 1 noise channel, 8 octaves (Yamaha YM-2149)",
      "ROM": "32 KB with TOS on disk / 192 KB with TOS on ROM",
      "CPU": "Motorola MC 68000",
      "GRAPHIC MODES": "16 colors among 512 (320 x 200) / 4 colors among 512 (640 x 200)  / monochrome (640 x 400) this last mode needs a special monitor.",
      "YEAR": "1986",
      "COLORS": "max. 512",
      "image": "atari_520stf_2logoversions_s1",
      "OS": "TOS + GEM",
      "BUILT IN MEDIA": "3.5'' disk-drive",
      "POWER SUPPLY": "Built-in power supply unit",
      "I/O PORTS": "Cartridge, Midi (in, out), Centronics, RS232c, Hard Disk, Floppy disk, RGB, Joystick, mouse",
      "NAME": "520 / 1040 STf / STfm",
      "id": 25,
      "ORIGIN": "U.S.A.",
      "SPEED": "8 mHz"
    },
    {
      "RAM": "6128+ : 128 kb",
      "BUILT IN LANGUAGE": "Locomotive Basic 1.1",
      "TEXT MODES": "20 x 25 with 16 colors",
      "MANUFACTURER": "Amstrad",
      "KEYBOARD": "QWERTY / AZEERTY mechanical keyboard",
      "description": "\r\nThese Amstrads were the successors of the Amstrad \nCPC 6128\n. Amstrad tried to prolong the life of the old 8-bit Amstrads, which suffered from competition with the new 16-bit home computers (like the Amiga and Atari ST).\r\n\n\r\nAmstrad made some important modifications to maintain the level of its machines, the CPC 6128 Plus became 95% compatible with the CPC 6128 (using the same operating systems AMSDOS and CP/M 3.0). However, some software did not run on the plus range and amstrad official statement was that the programmers where lazy and used bad programming in some software resulting in crashes on this machine.\r\n\n\r\nSeveral new features were added: hardware scrolling, increased color palette, an enhanced sound chip, a cartridge port, and a redesigned keyboard. Some of these features were not even present (yet) on certain 16-bit computers (Atari STf didn't have hardware scrolling or sprites). Regardless, this new version of the CPC didn't last long. \r\n\n\r\nThe system offers 16 hardware sprites at a size of 16x16 pixels. The sprites are using 15 other colors than the 16 of the palette, and have x/y zoom. The soundchip is the same AY as on the CPC, but controlable with a DMA.\r\n\n\r\nAs Atari did with the \n65-XE\n when it reached the end of its life, so Amstrad  made a game console from the Amstrad CPC Plus hardware called the GX 4000. This console used the same programs as the computer but were supplied on cartridges.\r\n\t\n\n\n",
      "title": "\r\n\t\t464 / 6128 Plus\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "3 stereo voices, 8 octaves",
      "ROM": "32 kb",
      "CPU": "Zilog Z80A",
      "GRAPHIC MODES": "160 x 200 with 16 colors",
      "YEAR": "1990",
      "COLORS": "31 maximum (16 + 15 for sprites) among 4096",
      "image": "amstrad_6128plus_system_1",
      "OS": "AMSDOS, CP/M 2.2 and CP/M +",
      "BUILT IN MEDIA": "CPC-464+ : Tape-recorder (without tape counter)",
      "POWER SUPPLY": "5v DC, through Amstrad monitor",
      "I/O PORTS": "Light pen / gun port",
      "PRICE": "CPC-6128+ : Monochrome - 455 ",
      "NAME": "464 / 6128 Plus",
      "id": 26,
      "ORIGIN": "United Kingdom",
      "SPEED": "4 mHz"
    },
    {
      "RAM": "16 KB (600 XL up to 64 KB) / 64 KB (800 XL, expandable to 128 KB)",
      "BUILT IN LANGUAGE": "Atari Basic",
      "TEXT MODES": "five text modes, max: 40 x 24, min: 20 x 12",
      "MANUFACTURER": "Atari",
      "KEYBOARD": "Mechanical keyboard",
      "CO-PROCESSOR": "GTIA (video), POKEY (sound, I/O), ANTIC (video)",
      "title": "\r\n\t\t600 / 800 XL\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "4 voices, 3.5 octaves",
      "END OF PRODUCTION": "January 85",
      "ROM": "24 KB",
      "CPU": "MOS 6502C",
      "GRAPHIC MODES": "16 graphic modes, maximum : 320 x 192",
      "YEAR": "1982",
      "COLORS": "256 (16 colors with 16 intensities)",
      "image": "atari_800xl_system_s1",
      "description": "\r\nThe Atari 800XL, together with the 600XL, were successors of the \nAtari 400/800\n series and the unsuccessful \nAtari 1200 XL\n in a more compact case. They could use almost the same software, just so long as the program was written correctly, because of some slight differences between OS versions.  \r\n\n\r\nThe 800XL had 64 KB of RAM, two joystick ports and kept all the custom chips (Pokey, GTIA, Antic) of the previous models. It also featured the new Parallel Bus Interface (PBI) providing high speed access to the system bus.  The new version of the graphic Antic chip offered 16 graphics modes instead of 12 for the 800.\r\n\n\r\nAn enhanced version, called \n800XLF\n, appeared in summer 1984. It was equipped with the new \"Freddie\" chip which allowed faster memory management, especially for graphics display. This version was released in Europe with SECAM \r\nvideo interface.\r\n\n\r\nAlongside the \nCommodore 64\n and the \nApple II\n, the 600 and 800XL were among the most popular home computers.\n\r\nThey would be replaced in 1985 with the \nXE\n series when Atari launched the \nST\n.\r\n\n",
      "POWER SUPPLY": "External power supply unit",
      "I/O PORTS": "Composite video output, cartridge slot, peripheral port (SIO), parallel bus, 2 joystick plugs",
      "PRICE": "183 ",
      "NAME": "600 / 800 XL",
      "id": 27,
      "ORIGIN": "U.S.A.",
      "SPEED": "1.79 (NTSC) / 1.77 (PAL) MHz"
    },
    {
      "RAM": "256kb, upgradable to  512k internally. Extensible to 8.5 MB with extension card (512 KB CHIP RAM + 8 MB FAST RAM) and to 10 MB",
      "TEXT MODES": "60 x 32 / 80 x 32",
      "MANUFACTURER": "Commodore",
      "KEYBOARD": "full-size typewriter style, 89 keys, 10 function keys and numeric keypad",
      "BUILT IN MEDIA": "one 3.5'' disk-drive, double sided double density, 880k formatted storage capacity",
      "CO-PROCESSOR": "3 : Denise (video), Agnus (memory manager, blitter & copper), Paula (sound and disk access)",
      "title": "\r\n\t\tAMIGA 1000\r\n\t\t",
      "SIZE / WEIGHT": "4.25'' x 17.75'' x 13''  / 13 lbs",
      "TYPE": "Home Computer",
      "SOUND": "Four 8 bit PCM voices, 9 octaves",
      "END OF PRODUCTION": "January 1987",
      "ROM": "8 KB (The Kickstart isn't in ROM but loaded at the boot in RAM, where it takes 256 KB)",
      "CPU": "Motorola MC68000",
      "GRAPHIC MODES": "320 x 200 and 320x400 (32 colors), 640 x 200 and 640 x 400 (16 colors)",
      "YEAR": "July 1985",
      "COLORS": "up to 64 colors among 4096 (EHB mode)",
      "image": "commodore_amiga1000_3",
      "OS": "AmigaDOS (1.0/1.1/1.2/1.3) + WorkBench (GUI)",
      "description": "\r\nThe inventor of the Amiga 1000 was \nJay Miner\n, who created the \nAtari 800\n many years before. He wanted to make the most powerful computer ever, then he joined a small Californian company called Amiga. He used the principle of the three coprocessors (again) to help the main processor.\r\n\n\r\nAt the beginning, the Amiga had only 64 kilobytes of RAM! The original \"Amiga\" called the Lorraine was meant to be a game machine with some computer capabilities.\r\n\n\r\nAtari initially invested the money in the Amiga Corp. to do the R&D on the Amiga computer line.  Naturally, when the design was finished, Amiga Corp. gave Atari the choice to purchase the technology.  Atari passed in favor of their own project. Amiga Corp. then offered the technology to Commodore, Inc., who were quite pleased to purchase it, seeing that their own 16-bit computer was so far from reaching the shelf.\n\r\nAfter the loss of a major legal battle for control of the Amiga chip set design, Atari launched the \nST\n series (Sixteen-Thirty-two)  as a competitor for the upcoming Amiga.\r\n\n\r\nThe operating system (AmigaDOS) was done by MetaComCo, a British company who specialized in the 68000 processor (they also made languages for the \nSinclair QL\n). It is a fully multitasking system which looks like UNIX with a graphical user interface.\n\r\nIt was the very first personal computer with great graphics and sound capabilities with a GUI environment.\n\r\nThe Amiga BASIC was written by Microsoft (like most other versions of BASIC), but the first models were shipped with a non-Microsoft BASIC called ABasiC.\r\n\n\r\nThe Amiga 1000 was to lose popularity one year later with the creation of its two main successors: the \nAmiga 500\n and the \nAmiga 2000\n.\r\n\n\r\nThere were two versions of the Amiga 1000. The first one sold only in the USA, had a NTSC display and no EHB video mode. Later versions would have this built in. The second one had a PAL display, the enhanced video modes (EHB) and was built in Germany.\r\n\n\r\nThe official name for the A1000 was the Commodore Amiga. It was only when the A2000 was launched that they officially began to refer to the machine by its model number.\r\n\n\n\n\n\n",
      "POWER SUPPLY": "120V, 90 Watts, 60Hz, 1A nominal",
      "I/O PORTS": "RGB, RF & composite video ouputs, external floppy disk port, Centronics, RS232c, Expansion port, stereo sound, Atari Compatible joysticks (2), RAM expansion port, keyboard connector",
      "PRICE": "£1700 (UK, 1985) - $1500 (USA, 1986) - £1285 (UK, Nov. 1986, 512K RAM)",
      "NAME": "AMIGA 1000",
      "id": 28,
      "ORIGIN": "U.S.A.",
      "SPEED": "7.16 mHz"
    },
    {
      "PERIPHERALS": "Controler card for 1 to 4 5''1/4 F.D. drives (1 400 F.F)",
      "RAM": "Model 1 : 16 kb",
      "BUILT IN LANGUAGE": "BBC Basic",
      "TEXT MODES": "80 x 32/25 (2 colors) / 40 x 32/25 (2 or 4 colors) / 20 x 32 (16 colors) / 40 x 25 (Teletext display)",
      "MANUFACTURER": "Acorn Computer",
      "KEYBOARD": "Full-stroke QWERTY keyboard, 64 keys, 10 function keys, arrow keys",
      "description": "\r\nThe Acorn BBC model A was the successor of the \nAcorn Atom\n and its first name was Acorn Proton. It was a very popular computer in the UK and was widely used in schools, but it didn't have great success elsewhere (even though it did have great features, it was too expensive). \r\n\n\r\nThe \nModel A\n lacked some of the connectors of the \nModel B/B+\n (User port, Tube, ...) on the underside.\r\n\n\r\nThis computer got its name because in 1980, the BBC decided to start a computer literacy television series. The network realized that, with more powerful and increasingly inexpensive microcomputers, it would soon be possible to create them with enough computing power to offer their owners personal hands-on experience with microcomputers at an affordable price. \n\r\nThe BBC considered the \nNewBrain\n computer and rejected it. Acorn and Sinclair Research, along with other companies, then submitted designs, and Acorn won. The BBC model B was then used almost universally in British schools from its birth into the 90's. \r\n\n\r\nIt was followed in 1982 by the Acorn \nBBC model B\n. The Model B had the same features but had 32 KB RAM (expandable to 64K).\r\n\n\r\nThe \"Tube\" was an expansion port which was designed to connect other processors to the BBC (6502, Z80, 68000 or ARM 1 RISC). An interface card was specially designed for the tube. It used another 6502 and a Z80.\r\n\n\r\nOne of its most popular peripherals was the \"Torch\" floppy disk unit, a 5.25\" floppy disk drive with a Z80 which allowed the BBC to use CP/M software. \r\n\n\r\nAcorn also made a \"cheap\" version of the BBC (fewer connectors & video modes) called \nAcorn Electron\n.\r\n\n\r\nIn 1985, the Acorn \nBBC Model B+\n was released. The Model B+ had new features : 64K of RAM instead of 32 KB and internal circuitry for the Econet and Disk Drive as standard (both available as an upgrade in the models A and B). The later models included disk support as standard, using either an 8271 or a 1770 disk controller. There was also a B+ 128KB model (with and extra 4x16KB banks of \"sideways RAM\"). The B+ models had 48KB of ROM because they had an extra 16KB with the DFS. They used a MOS 6512A processor, but at the same 2MHz that the A and B models used.\r\n\n\r\nIt was then followed by the BBC Master.\r\n\n\r\n_________\r\n\n\n\nContributors:\n Gabriel Graça\n\n\n\n\n",
      "title": null,
      "SIZE / WEIGHT": "41 (W) x 34.5 (D) x 6.5 (H) cm / 3700 g",
      "TYPE": "Home Computer",
      "SOUND": "3 channels + 1 noise channel, 7 octaves",
      "END OF PRODUCTION": "Unknown",
      "ROM": "32 kb",
      "CPU": "MOS 6502",
      "GRAPHIC MODES": "640 x 256 (2 colors) / 320 x 256 (4 colors) / 160 x 256 (16 colors)",
      "YEAR": "1981",
      "COLORS": "16 (8 colors + flashing option)",
      "image": "acorn_bbcb_system_s1",
      "POWER SUPPLY": "Built-in switching PSU",
      "I/O PORTS": "UHF TV out, BNC video out, RGB vide out, RS423, Cassette, Analogue In (DB15), Econet port, TUBE interface, 1Mhz BUS, User port, Printer port, Disk-drive connector",
      "PRICE": "£399 (UK 1983) - 1181 ",
      "NAME": "BBC Model A / B / B+",
      "id": 29,
      "ORIGIN": "United Kingdom",
      "SPEED": "1.8 MHz"
    },
    {
      "RAM": "1-2 MB Chip RAM, up to 18 Mb (with 16Mb FAST) and theoricaly to 4 Gb.",
      "TEXT MODES": "60 x 32 / 80 x 32",
      "MANUFACTURER": "Commodore",
      "CO-PROCESSOR": "3 : Super Denise (video),Fat  Agnus (memory manager, blitter & copper), Paula (I/O, sound), 68881 or 68882 (math processor), SCSI DMAC",
      "title": "\r\n\t\tAMIGA 3000\r\n\t\t",
      "TYPE": "Professional Computer",
      "description": "\r\nThe Commodore Amiga 3000 is the successor of the \nAmiga 2500\n (itself a successor of the \nAmiga 2000\n). It was replaced three years later with the \nAmiga 4000\n. \r\n\n\n\nAmiga Interactive Guide\n description :\n\n\nThe A3000 is a powerhouse in comparison to previous Amiga, it was sold as a high-end graphics workstation. For a time it was used by W Industries as the basis of their highly acclaimed Virtuality machines. At the heart of the A3000 was the powerful 68030 (described in ST/Amiga Format as a 'as a mainframe on a chip'). In addition the A3000 was the first Amiga to feature the new Kickstart 2 upgrade and Zorro III slots. \r\n\n\r\nTo emphasis the A3000s capabilities as a high-end workstation, two operating systems were included: \n\r\nThe first was the newly released Kickstart/Workbench 2. This was unusual by the fact that Kickstart was stored on the hard disk rather than in ROM. This was similar to the A1000 that required Kickstart to be loaded from floppy disk before anything else could be done. \r\n\n\r\nThe second OS to be included with the A3000 was the Unix System (SVR4) V operating system. This allowed the use of the Unix graphical interface, X Windows and Open Look. It also came with standard networking capabilities (probably a first for Commodore), such as TCP/IP, NFS and RFS for networking between different operating systems. In a bizarre twist, the Unix OS was sold on a magnetic tape rather than floppy disk. \r\n\n\n\n\r\nThree Amiga 3000 models were produced : 3000, 3000UX, and 3000T.\r\n\n\r\nThe \n3000\n was the desktop model (pictured here) which shipped with flippable 1.3 or 2.0 AmigaOS Roms. The \nAmiga 3000T\n, released in 1991, was a tower system with built-in speaker, 32Mb RAM, high-resolution mouse, 100 Mb hard-drive, a lot of Zorro II slots, a variety of drive bays, and a 25Mhz 68030 with a 68882 math coprocessor. The \n3000UX\n shipped with \"AMIX\", Commodore's System-5 derived UNIX which was very nice and came with X-windows. It was Commodore's only serious attempt to get into the UNIX workstation market, and a noble effort that unfortunately failed utterly.\r\n\n\r\nNotice there are some rare versions of the Amiga 3000: the \n3000/16\n (the speed is only 16 MHz) and the \nAmiga 3000+\n which uses an AGA video chip and a DSP. The 3000+ was a prototype only. A few units are known to exist, but they are not supported. The DSP was able to function as a software modem in some configurations, which was extremely cool.\r\n\n",
      "SOUND": "Four 8 bit PCM voices",
      "ROM": "512 KB",
      "CPU": "Motorola MC68030",
      "GRAPHIC MODES": "12 graphic modes : from 320 x 240 to 960 x 512",
      "YEAR": "1990",
      "COLORS": "32 (for 320 x X modes), 16 (for 640 x X modes) among 4096 + 2 Special modes : EHB 64 colors and HAM 4096 colors on static display.",
      "image": "commodore_amiga_3000_nb",
      "OS": "AMIGA WorKBench 2.0x, Unix System (SVR4) V operating system",
      "BUILT IN MEDIA": "one 3.5'' disk-drive (880k), SCSI-2 Hard-Drive",
      "POWER SUPPLY": "Internal PSU",
      "I/O PORTS": "Video (RGB, Composite), Parallel/Centronics, RS232c, SCSI, VGA, stereo sound, joysticks (atari) & mouse, 4 Zorro III internal slots, 2 ISA slots, 1 CPU slot, 1 video slot, external floppy, external SCSI-2, keyboard, Stereo audio output",
      "PRICE": "Amiga 3000T (100Mb HD) : $4498 (USA, 1991)",
      "NAME": "AMIGA 3000",
      "id": 30,
      "ORIGIN": "U.S.A.",
      "SPEED": "16 / 25 mHz"
    },
    {
      "RAM": "4MB",
      "TEXT MODES": "Max : 132 x 30",
      "MANUFACTURER": "Acorn Computer",
      "KEYBOARD": "84 keys with arrow keys",
      "description": "\r\nThe Acorn A4 was the laptop version of the \nAcorn Archimedes\n and was one of the first RISC laptops  (and by the way, one of the most powerful - five times faster than a 50 MHz 486 for some operations).\r\n\n\r\nThe operating system (RISC OS 3.10) was located in the 2 MB ROM. The 9'' LCD screen could only display 14 shades of grey, but used a clever dithering system to make more shades apparent.\r\n\n\r\nThe A4 could be used for about 3 hours with its internal batteries.\r\n\n\n\nRob Kendrick\n sent us more info :\n\n\nThe case is actually an Olivetti laptop case, with an A5000 in it. Olivetti owned large chunks of Acorn at the time. The main difference between an A5000 (a desktop machine) and a A4 is that the A5000 had a 16MHz memory bus and a 33MHz ARM3.\r\n\n\r\nIt had an advanced battery management unit that allows fine-grained control of the clock rate of the CPU (it can drop as low as 2MHz when the computer is idle and go back up to 24MHz when its busy) and the turning off of most of the hardware independently (such as the serial ports, floppy drive, hard drive etc)\r\n\n\r\nThe filing system doesn't fragment. At all.\n\n\n\n\n",
      "title": "\r\n\t\tA4\r\n\t\t",
      "TYPE": "Portable",
      "SOUND": "8 voices (stereo 8 bit)",
      "ROM": "2 MB",
      "CPU": "ARM 3 (with 4 KB of internal RAM cache)",
      "GRAPHIC MODES": "47 graphic modes, maximum 640 x 480 with LCD screen and up to 1152 x 896 with VGA screen",
      "YEAR": "1991",
      "COLORS": "14 shades of grey (LCD screen)",
      "image": "acorn_a4_running_s1",
      "OS": "RISC OS 3.10",
      "BUILT IN MEDIA": "one 3.5'' disk-drive",
      "POWER SUPPLY": "External PSU",
      "I/O PORTS": "VGA, Centronics, RS232 C, stereo sound, Mouse, Keyboard",
      "PRICE": "£1395 (2Mb floppy version) up to £1895 (4Mb HD120 version)",
      "NAME": "A4",
      "id": 31,
      "ORIGIN": "United Kingdom",
      "SPEED": "24 mHz (internal CPU) and 12 mHz (bus)"
    },
    {
      "RAM": "2Mb CHIP RAM + 2Mb or 4Mb Fast RAM (up to 16 Mb, and theorically to 4 Gb)",
      "TEXT MODES": "60 x 32 / 80 x 32",
      "MANUFACTURER": "Commodore",
      "KEYBOARD": "detachable full-stroke keyboard with 10 function keys and cursor keys and separate numeric keypad",
      "CO-PROCESSOR": "Alice (Blitter and Memory Manager), Lisa (Video chip)",
      "title": "\r\n\t\tAMIGA 4000\r\n\t\t",
      "SIZE / WEIGHT": "15 1/4'' deep x 15'' wide x 5'' high / 20 pounds",
      "TYPE": "Home Computer",
      "description": "\r\nIn 1992 Commodore launched the most advanced Amiga yet. The A4000 used the AGA chipset to allow it to show 256,000 colours on screen from a palette of 16.8 million, as well as the new Workbench 3 that introduced the concept of among other things, datatypes. The Amiga 4000 is one of the most powerful Amigas ever made.\r\n\n \r\nAs a replacement for the A3000 & A3000T, the A4000 was a combination of the A2000 (big box), A3000 (vertical slots (integrated hard drive controller) and A1200 (AGA chips). As standard it allows memory expansion for up to 18Mb RAM on the motherboard. It shipped with either a 25 MHz 68030/68882 or 25 MHz 68040 CPU. The A4000 was never intended for release, but was a prototype for a system known as the A3000 Plus which was a considerably better machine. The machine was eventually cancelled and the A4000 drafted for release due to the low cost of development. \r\n\n\r\nLike the \nAmiga 3000\n, the 4000 has 2 MB of chip RAM (reserved for its coprocessors) and 4 MB of fast RAM (used directly by the 68040).\r\n\n\r\nThe Amiga 4000 mainboard was planned to use the AAA chip (the video custom chip designed to replace the AGA chip), the AAA chip was theoretically designed to use 8 MB FastRAM (see the \"Chip RAM : ON=2MB, OFF=8MB\" jumper on the motherboard), unfortunately, Commodore didn't use this chip, so this jumper is absolutely useless. \r\n\n\r\nThere's an internal 120 MB IDE hard disk and 4 expansion slots: three ISA slots (for PC compatible cards) and one dedicated 32 bit video slot used for graphics cards.\r\n\n\r\nThe Amiga 4000 works under WorKBench 3.0, a very powerful and flexible multitasking system which looks like UNIX, it can read & write directly to DOS 1.44 Mb floppy disks.\r\n\n\r\nThe Amiga 4000 was mainly used for video production but was in direct competition with the PC compatibles when most of its major products (ImageIn, Real 3D, & Lightwave, to name a few) were adapted for Windows.\r\n\n\r\nThere were in fact two models of Amiga 4000 :\n\r\n- the \nA4000-040\n released in September 92 with a Motorola 68040 Processor, 6 Mb RAM, internal 3.5\" 1.76 Mb Floppy Drive and 120 Mb IDE Hard Drive,\n\r\n- and the \nA4000-030\n released March 93, with Motorola 25MHz 68030EC processor, 4Mb RAM (2Mb Chip, 2Mb Fast), 3.5\" FDD, 120Mb hard disk, etc.\r\n\n\r\nThere was even a more powerful successor called \nAmiga 4000T\n (\"T\" stands for Tower). The A4000T is basically an A4000 in a full tower case with IDE & SCSI-2 Fast controllers integrated as well as 2 video slots and shipped with a 25MHz 68040 processor.\r\n\n\r\nA lot of expansion hardware has been developed for the 4000/1200 : Video cards (2000 x 1500 in 24 bit), 3D cards, Wide SCSI controllers and PowerPC 604e/233 MHz accelerator cards.\r\n\n\r\nThe Amiga scene is still very active and great software is still being developed.\r\n\n\n\nSource : \nAmiga Interactive Guide\n.\r\n\n\n\nTodd Deery\n reports:\n\r\nThere was at least one other version of the Amiga 4000 available (at least in Canada) -- the Amiga 4000LC.  This version contained the 25Mhz LC version of the 68040, which lacked a math coprocessor.\n\n\n\r\nfrom \nChris Coulson\n:\n\r\nHere in the UK, the 4000-030 (not sure if this is true for the -040 as well) was also available with an 80MB HD in place of the 120MB drive.\n\n\n\n\n",
      "SOUND": "Four channel stereo sound, 8 bits D/A converters",
      "ROM": "512 Kb",
      "CPU": "Motorola MC68EC030 (Eco version of the 68030) or MC68040",
      "GRAPHIC MODES": "from 320 x 200 to 800 x 600 or 1280 x 400 and more with overscan",
      "YEAR": "1992",
      "COLORS": "16.8 millions colors",
      "image": "commodore_amiga4000_toaster_2",
      "OS": "AMIGA WorKBench 3.x, AmigaDOS 3.0",
      "BUILT IN MEDIA": "3.5-inch high density disk drive (880 KB/1.76 MB formatted) and 120Mb hard-drive",
      "POWER SUPPLY": "Built-in PSU",
      "I/O PORTS": "Centronics, RS232c, internal and external disk-drive ports, internal AT IDE port, keyboard, audio stereo output, mouse/joysticks (2), RGB,optional SCSI adapter, Four 16/32-bit Zorro III expansion slots, Three PC AT slots, Video slot",
      "NAME": "AMIGA 4000",
      "id": 32,
      "ORIGIN": "U.S.A.",
      "SPEED": "25 mHz"
    },
    {
      "RAM": "4 MB",
      "TEXT MODES": "Unknown",
      "MANUFACTURER": "Atari",
      "CO-PROCESSOR": "Unknown",
      "title": "\r\n\t\tAbaq ATW Transputer 800\r\n\t\t",
      "TYPE": "Professional Computer",
      "description": "\r\nThis strange machine was shown at Comdex in 1987. It was designed for graphics intensive applications taking advantage of the parallel processing capacities of the INMOS transputer.\r\n\n\r\nTwo models were sold: one of them was a card which could be connected onto a \nMega STf\n bus expansion to use its peripherals (keyboard, disk, etc.). The other was a computer in which there was a motherboard with a single transputer plus a card which contained all the Atari Mega STf hardware to use its peripherals!\r\n\n\r\nThe motherboard included slots to add up to four more processor cards, each\r\nwith up to four transputers, to enable multiprocessing.\r\n\n\r\nIt ran under Helios, an operating system done by the British company \nPerihelion\n, derived from UNIX but specially adapted for parallel processing).\r\n\n\r\nA C language was adapted and a parallel processing language called OCCAM. Only few of these computers were sold, most of them to Kodak.\r\n\t\n\n\n",
      "SOUND": "Unknown",
      "ROM": "Unknown",
      "CPU": "RISC Inmos T-800 32 bits (4 mips)",
      "GRAPHIC MODES": "4 modes, maximums : 1280 x 960 and 1024 x 768",
      "YEAR": "1987",
      "COLORS": "16 (1280 x 960), 256 (1024 x 768) among 16.7 millions",
      "image": "abaq",
      "VRAM": "1 MB",
      "OS": "HELIOS",
      "BUILT IN MEDIA": "Unknown",
      "I/O PORTS": "Unknown",
      "NAME": "Abaq ATW Transputer 800",
      "id": 33,
      "ORIGIN": "U.S.A.",
      "SPEED": "Unknown"
    },
    {
      "PERIPHERALS": "external disk-drives, 10Mb and 20Mb Winchester hard-disk",
      "RAM": "64 kb (up to 1Mb)",
      "TEXT MODES": "80 x 24",
      "MANUFACTURER": "AI Electronics",
      "KEYBOARD": "Mechanical QWERTY / AZERTY keyboard",
      "CO-PROCESSOR": "Arithmetic processor",
      "title": "\r\n\t\tABC 24\r\n\t\t",
      "TYPE": "Professional Computer",
      "description": "\r\nThe ABC-24 and \nABC-26\n could run up to 8 programs simultaneously and could manage 7 work-stations under M/PM (according to the advertisement). they has a real-time clock and 96 graphic symbols built-in.\r\n\n\r\nThere were several models : \n20\n, 21, 22, 23, 24, 25 and \n26\n, mostly differentiated by their storage capacities...\n\r\nThe 2x Models were the successors of the ABC 10, which had a digital tape auxillary memory, supplied with DOSKET-T.\r\n\n\r\nAI DOSKET is the AI Electronics Operating System. A lot of languages were developed for these computers: MBasic, CBasic, Basic, Pascal, Cobol80, PL/3, Fortran IV and assembler.\r\n\n\n\nPicture courtesy of \nwww.gaby.de\n.\n\n\n\n\n",
      "ROM": "4 kb (monitor)",
      "CPU": "Zilog Z80A",
      "GRAPHIC MODES": "640 x 288 optional (PLOT 10 compatible)",
      "YEAR": "? 1979",
      "COLORS": "monochrome (12'' green monitor)",
      "image": "ai_electronics_abc24_1",
      "OS": "Dosket, CP/M & M/PM",
      "BUILT IN MEDIA": "2 x 5''1/4 disk-drives (320k each)",
      "POWER SUPPLY": "PSU built-in",
      "I/O PORTS": "2 x serial ports - 2 x parallel ports x 1 GP-IB (IEEE 488) port",
      "NAME": "ABC 24",
      "id": 34,
      "ORIGIN": "Japan",
      "SPEED": "4 Mhz"
    },
    {
      "RAM": "128kb",
      "BUILT IN LANGUAGE": "Sinclair Basic 48k and Sinclair Basic 128k",
      "TEXT MODES": "32 x 24",
      "MANUFACTURER": "Sinclair",
      "KEYBOARD": "Same as the Spectrum+",
      "description": "\r\nThe Spectrum 128 (code named Derby) is the successor of the \nSpectrum +\n. It was made just before Amstrad bought the right to use the Sinclair name in computer products. So it can be regarded as the last \"real Sinclair Spectrum\".\r\n\n\r\nThe 128 is the first real evolution of the old \nSpectrum\n. It has a lot of new features: 128kb RAM, a new sound chip (Yamaha AY-3-8912), RS232/Midi and video RGB outputs.\r\n\n\r\nThe Spectrum displays a menu when it is switched on: \n\r\n- \"Tape Loader\" to run programs on tape,\n\r\n- \"Calculator\" to enter operations without typing PRINT before,\n\r\n- \"Tape Tester\" to test the input level of the tape recorder,\n\r\n- \"BASIC 48\" and \"BASIC 128\".\r\n\n\r\nThe Spectrum 128 can use two versions of BASIC: BASIC 48 is just for the compatibility with the previous models and can't use the new features.\n\r\nThe Basic 128 mode has  a full screen editor and the user can enter the Basic statements letter by letter instead of pressing key combinations. It has new keywords to use the extended memory as a RAM disk (unless bank-switching routines are utilized) and to handle the new sound chip and the MIDI out socket.\r\n\n\r\nBecause there were still large unsold stocks of Spectrum+ in the UK, the Spectrum 128 was first launched in Spain where the Speccy was already very popular. It was sold there with an external numeric keypad to connect the main unit. This \"spanish model\" doesn't boot on a \"start menu\" as the UK version does (thus spanish 128k models are slightly different than later UK models). But even after being introduced in UK it had a short market life and was replaced with the \nSpectrum +2\n.\r\n\t\n\n\n",
      "title": "\r\n\t\tZX SPECTRUM 128\r\n\t\t",
      "SIZE / WEIGHT": "320 x 150 x 45 mm",
      "TYPE": "Home Computer",
      "SOUND": "3 channels, 7 octaves (Yamaha AY-3-8912)",
      "END OF PRODUCTION": "1986",
      "ROM": "32kb (16k 48k Basic + 16k 128k Basic)",
      "CPU": "Zilog Z80 A",
      "GRAPHIC MODES": "256 x 192",
      "YEAR": "1985",
      "COLORS": "8 with two tones each (normal and bright)",
      "image": "sinclair_spectrum128_1",
      "POWER SUPPLY": "External PSU, 9v DC, 1.85A (centre polarity = -ve)",
      "I/O PORTS": "Expansion bus, Numeric Keypad, RS232 / Midi Out, Video RGB, Tape (1200 baud)",
      "NAME": "ZX SPECTRUM 128",
      "id": 35,
      "ORIGIN": "United Kingdom",
      "SPEED": "3.5469MHz"
    },
    {
      "RAM": "128 KB",
      "TEXT MODES": "40 x 24 / 80 x 24",
      "MANUFACTURER": "Apple",
      "KEYBOARD": "Full stroke keyboard",
      "description": "\r\nThe Apple IIc Plus unit was a direct response to the \nLaser 128EX/2\n.\r\n\n\r\nApple retrofitted the \nIIc\n design to try to compete with Video Technology's high-speed Apple II clone.  The retrofitting is evident in the design of the motherboard.  The motherboard runs at 1Mhz, unlike the Laser 128EX/2.  In order to run its programs faster, Apple used a 4Mhz 65C02 with 8k of high speed SRAM cache and licensed the accelerator design from Zip Technologies (makers of the ZipChip accelerator for the IIe and IIc).  They built an accelerator into a 1Mhz motherboard rather than designing a faster motherboard from scratch.\r\n\n\r\nThe designers of the Apple IIc Plus originally wanted to make a portable \nIIGS\n.   Apple's management, bent on promoting the Mac, balked at the idea.  At the same time, the Laser 128EX/2 made a quick design cycle mandatory.  The result was an updated IIc.\r\n\n\r\nThe Apple IIc Plus was the finest Apple 8-bit computer ever built, but due to a lack of marketing, the apparent backward step in technology compared to the 16-bit \nApple IIGS\n, and the aggressive sales of the Laser 128EX/2, the IIc Plus also was to be the most short-lived of the Apple II models. \r\n\n\r\nThanks to \nSteve\n and his \nsite\n for the picture.\n\n\n",
      "title": "\r\n\t\tAPPLE IIc Plus\r\n\t\t",
      "TYPE": "Transportable",
      "SOUND": "one channel (Because the Apple IIc Plus operates at 4Mhz, sounds from Apple II programs are distorted, but you can cut the speed down to 1Mhz on start up for games).",
      "ROM": "128 KB (Contains AppleSoft Basic and an ML",
      "CPU": "65C02",
      "GRAPHIC MODES": "(only the full screen modes are listed here) : 40 x 48 (16 col) / 80 x 48 (16 col) / 280 x 192 (6 col) / 140 x 192 (16 col) / 560 x 192 (16)",
      "YEAR": "1988",
      "COLORS": "16 (256 colors with a upgrade that was availble in 1989)",
      "image": "apple_iic_plus",
      "OS": "DOS 3.3, ProDOS, UCSD Pascal",
      "BUILT IN MEDIA": "one 3.5'' diks-drive",
      "POWER SUPPLY": "External power supply unit (?)",
      "I/O PORTS": "Monitor, Joystick/Mouse, RGB, Floppy Disk, RS232c (2), Video Expansion, Internal Modem Connector",
      "PRICE": "Unknown",
      "NAME": "APPLE IIc Plus",
      "id": 36,
      "ORIGIN": "U.S.A.",
      "SPEED": "4 MHz"
    },
    {
      "RAM": "16 KB (up to to 32 KB)",
      "BUILT IN LANGUAGE": "Luxor Basic",
      "TEXT MODES": "40 x 24 (ViewData and Teletext compatible)",
      "MANUFACTURER": "Luxor",
      "KEYBOARD": "Full-stroke 55 keys",
      "description": "\r\nIn August 1978, first units of the \"Advanced Basic Computer for the 1980s\", in short ABC-80 left the Swedish Luxor factory. \r\n\n\r\nA few months earlier, Luxor contracted with two other companies, Scandia Metric and Data Industrier AB (DIAB), to build the first totally Swedish computer. Scandia Metrics which had previous experience of computer based products designed the main board, DIAB manufactured the chips, while Luxor, one of the biggest TV set manufacturers, built the monitor, case and keyboard and assembled the whole system in its assembly plant of Motala (Sweden, at the northeast shore of Swedens second largest sea, Vättern). \r\n\n\r\nDespite the fact that the technology behind the ABC 80 was very simple and technical features wasn't better than US competitors, the ABC80 was a quality machine and became a great success among early Swedish computer enthusiasts, who had been waiting for a long time a real local computer. More than 10.000 computers were sold within two years. For six years, the ABC80 and then its sequel the ABC800, were by far the most sold and used personal computers in Sweden, for home, hobby, and especially education. \r\n\n\r\nMany schools in Sweden had ABC 80 or \nABC 800\n for the students. It was possible to connect together several ABC 80 thanks to a network called ABC NET.\r\n\n\r\nIn 1984, the ABC1600 and ABC9000, two Unix systems, were launched with the slogan \"Who needs to be IBM compatible?\"... They were the last Luxor computers produced.\n\n\n\n\n",
      "title": null,
      "TYPE": "Home Computer",
      "SOUND": "1 channel - Built-in speaker",
      "ROM": "16 KB",
      "CPU": "Z 80",
      "GRAPHIC MODES": "78 x 72",
      "YEAR": "1978",
      "COLORS": "Monochrome",
      "image": "luxor_abc80_system_s1",
      "BUILT IN MEDIA": "Optional 2 x 5.25'' disk-drives",
      "POWER SUPPLY": "Unknown",
      "I/O PORTS": "V24 / RS232",
      "PRICE": "From $1400",
      "NAME": "ABC 80",
      "id": 37,
      "ORIGIN": "Sweden",
      "SPEED": "3 MHz"
    },
    {
      "CPU": "U880A (GDR Z80A)",
      "GRAPHIC MODES": "192 x 256 dots",
      "YEAR": "1984",
      "BUILT IN LANGUAGE": "BASIC interpreter",
      "COLORS": "Monochrome",
      "TEXT MODES": "16 lines x 42 characters",
      "MANUFACTURER": "Microkey KFFT",
      "TYPE": "Home Computer",
      "KEYBOARD": "Membrane keyboard",
      "SOUND": "Beeper",
      "description": "\r\nThe Primo computer series was manufactured by Microkey Kftt. (Kutatási Fejlesztési Termelési Társulás), and was originaly developed to be a school computer in Hungary.\n\r\nThe system was sold in various memory configurations:\n\n\nA-32\n: 16K ROM 16K RAM\n\n\nA-48\n: 16K ROM 32K RAM\n\n\nA-64\n: 16K ROM 48K RAM\n\n\nB-64\n: 16K ROM 48K RAM\n\r\nOther differences were:\n\r\nA type did not have built-in joystick and serial ports.\n\r\nB type could works togewther with the Commodore VC1541 \r\nfloppy drive unit (external software had to be load for this from tape).\n\r\nB type also featured a full stroke keyboard (capacitive was not a \r\nperfect way for quick typing).\n\r\n\r\nThere was a colour prototype as well, called \npro PRIMO.\n\n\n\r\nThanks to \nViktor Varga\n for information and pictures.\n\n\n\n\n",
      "title": "\r\n\t\tPRIMO A-32\r\n\t\t",
      "image": "primo_a32_system_1",
      "ROM": "16 KB",
      "NAME": "PRIMO A-32",
      "POWER SUPPLY": "External power supply unit",
      "id": 38,
      "ORIGIN": "Hungary",
      "SPEED": "2.5 MHz (up to 3.5 MHz with some hacking)",
      "RAM": "16 KB (up to to 32 KB)"
    },
    {
      "PERIPHERALS": "Tape recorder, UART (Async. receiver/transmitter, with 8251), Floppy Interface (2 x 720 KB FDD)",
      "RAM": "32 KB or 64 KB, depending on models",
      "BUILT IN LANGUAGE": "TVC Basic",
      "TEXT MODES": "64 x 24",
      "MANUFACTURER": "Videoton",
      "KEYBOARD": "Full-stroke keyboard, hungarian layout (QWERTZ)...",
      "CO-PROCESSOR": "HD46505SP (CRT controller)",
      "title": "\r\n\t\tTV Computer\r\n\t\t",
      "SIZE / WEIGHT": "46 (W) x 19 (D) x 11(H) cm / 2.8 kg (+ 0.8 kg for the separate PSU)",
      "TYPE": "Home Computer",
      "SOUND": "1 channel",
      "ROM": "20 KB (OS+Basic), 24 KB max.",
      "CPU": "Z80",
      "GRAPHIC MODES": "128 x 240 (16 colors), 256 x 240 (4 colors), 512 x 240 (2 colors)",
      "YEAR": "1983",
      "COLORS": "16",
      "image": "videoton_tv_computer_64plus_2",
      "VRAM": "TV-Computer 32k & 64k : 16 KB",
      "OS": "TVC OS, UPM (special CP/M for TVC), VT-DOS (DOS 3.10 compatible)",
      "description": "\r\nThis computer was used in the 80's in Hungarian schools along with the Primo. It was very similar to the \nEnterprise 64\n as it was a licensed product. There is even a built-in joystick on the right of the keyboard.\r\n\n\r\nThere are different models : 32 KB, 64 KB and 64 KB+ (picture here). The 64 KB+ has more video RAM (64 KB instead of 16 KB) and different versions of ROM (2.1 - 2.2 & 2.4 instead of 1.1 -1.2 - 1.3 & 1.4).\r\n\n\r\nThe main physical difference of the TV-Computer is the four expansion slots that are placed at the top left side of the case, allowing easy upgrade of the system. On the left side, one can find two joystick connectors and a cartridge slot (16 KB max.) for games, applications and operating systems. TVC OS is built-in the system (along with Basic), but UPM (special version of CP/M for the TVC) or VT-DOS (DOS 3.10 compatible) could be implemented this way. VT-DOS could only read/write IBM PC disks, as it was not fully compatible with both the hardware and software.\r\n\n\n\nThanks to \nGabor Monok\n for all the info & pictures!\n\n\n",
      "POWER SUPPLY": "External power supply unit: +12V, -12V, +5V",
      "I/O PORTS": "Cassette interface, Centronics, 2 x joystick connectors, 1 cartridge slot, 4 expansion slots (8 KB ROM max. each)",
      "PRICE": "12800 HUF / 53 ",
      "NAME": "TV Computer",
      "id": 39,
      "ORIGIN": "Hungary",
      "SPEED": "3.125 Mhz"
    },
    {
      "RAM": "2.5 kb",
      "BUILT IN LANGUAGE": "MAX BASIC on cartridge",
      "TEXT MODES": "40 x 25",
      "MANUFACTURER": "Commodore",
      "KEYBOARD": "Flat membrane keyboard, 4 function keys, 2 arrow keys",
      "CO-PROCESSOR": "SID (Sound chip), 6566 VIC-II (Video chip)",
      "title": "\r\n\t\tMAX Machine / Ultimax / VC-10\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "SID (Sound Interface Device) : 3 voices, 9 octaves",
      "ROM": "2kb",
      "CPU": "MOS 6510 (6502 compatible)",
      "GRAPHIC MODES": "320 x 200",
      "YEAR": "1982",
      "COLORS": "16",
      "image": "commodore_max_front_2",
      "description": "\r\nThe Commodore MAX was released after the \nVIC 20\n and at the same time as the \nC64\n.  It was intended to be Commodore’s low-end offering ($150-180), whereas the C64 was envisioned as a high-end product ($595).\r\n\n\r\nThe system was very inexpensive and lacked even basic features such a user expansion port.  In reality, the MAX was a severely limited C64.  Several MAX software titles could actually be run on the C64.\r\n\n\r\nSome production models used the same video chip as the C64, while others used a 6566 (the NTSC C64 uses the 6567; the PAL C64 uses a 6569).  Regardless of video chip, both variants offered only a single graphics resolution of 320x200 and could not utilize the ‘multi-color’ functions available on the C64.  The SID sound chip is identical to the one found in its C64 cousin.  BASIC was stored on cartridge rather than in ROM.\r\n\n\r\nThough initially planned for world-wide release, the Commodore MAX was sold primarily in Japan.  It was advertised in North America under the name \nULTIMAX\n, as well as in Germany under the name \nVC-10\n. \r\n\n\r\nThanks to \nDr IDO\n for some information.\n\n\n\n\n",
      "POWER SUPPLY": "External PSU : AC100v, 50/60Hz, 25VA / DC 5v 1.2A / AC 9v 0.45A",
      "I/O PORTS": "Power in (DIN7), Audio output (minijack), Cartridge port, RF TV out, Cassette interface (bus), 2 x joystick connectors",
      "NAME": "MAX Machine / Ultimax / VC-10",
      "id": 40,
      "ORIGIN": "U.S.A.",
      "SPEED": "1 Mhz"
    },
    {
      "PERIPHERALS": "16kb RAM expansion",
      "RAM": "32 kb (up to 64 kb)",
      "BUILT IN LANGUAGE": "Basic v1.0 (Microsoft Basic)",
      "TEXT MODES": "36 x 24",
      "MANUFACTURER": "Video Technology",
      "KEYBOARD": "QWERTY, 49 typewriter keys",
      "description": "\r\nIn June 1983, Video Technology presented a prototype of the Laser 2001 (and the Apple II compatible Laser 3000 the same day) which can use Colecovision and Atari VCS 2600 cartridges!\r\n\n\r\nThe Laser 2001 was also sold as the \nSalora Manager\n in Scandinavia\n\n\n\n\n",
      "title": null,
      "TYPE": "Home Computer",
      "SOUND": "4 voices (3 voice channels + 1 noise channel)",
      "ROM": "16 kb",
      "CPU": "6502 A",
      "GRAPHIC MODES": "256 x 192",
      "YEAR": "June 1983",
      "COLORS": "16",
      "image": "vtech_laser2001_s",
      "VRAM": "16 kb",
      "POWER SUPPLY": "External PSU (see exact specs in the MORE PICTURES section)",
      "I/O PORTS": "expansion port (system bus), audio output, composite video output, RF TV video output, cassette interface, 2 x joystick ports (Atari standard DB9), cartridge slot",
      "NAME": "LASER 2001",
      "id": 43,
      "ORIGIN": "Hong Kong",
      "SPEED": "2 MHz"
    },
    {
      "CPU": "Signetics 2650",
      "GRAPHIC MODES": "None",
      "YEAR": "1977",
      "COLORS": "Monochrome",
      "TEXT MODES": "80 chars. x 16 lines",
      "MANUFACTURER": "Central Data",
      "TYPE": "Home Computer",
      "image": "centraldata_2650_2s",
      "I/O PORTS": "S-100 BUS, one parallel input port",
      "description": "\r\nThe 2650 was first reviewed in the US magazine Radio-Electronics, in the April 1977 issue.\n\r\nThis computer was supplied in assembled form with an Editor / Assembler. A 12K BASIC was also available on cassette tape or floppy if you had the HD interface.\r\n\r\n\t\n\n\n",
      "title": "\r\n\t\t2650\r\n\t\t",
      "ROM": "8 KB",
      "NAME": "2650",
      "PRICE": "2650 board : $275",
      "id": 45,
      "ORIGIN": "U.S.A.",
      "SPEED": "1.18MHz (Xtal of 14Mhz divided by 12), later increased to 4.73Mhz with improved 2650 chips",
      "RAM": "2 KB (up to 32 KB)"
    },
    {
      "CPU": "6502",
      "GRAPHIC MODES": "None",
      "YEAR": "1978",
      "BUILT IN LANGUAGE": "Microsoft BASIC interpreter",
      "TEXT MODES": "64 x 32",
      "MANUFACTURER": "OHIO Scientific",
      "TYPE": "Home Computer",
      "image": "ohio_scientific_challenger2",
      "POWER SUPPLY": "internal P.S.U.",
      "I/O PORTS": "Tape, Monitor, Four Slots",
      "description": "\r\nThis computer is based on the MODEL 500 CPU board. It is actually a Super Kit (see \nModel 500\n) assembled with a cassette interface and a keyboard. OHIO Scientific presented two enhanced versions of the Challenger IIP : the Challenger II Disk Systems and the \nChallenger III\n.\n\r\nThe Disk System version came with 16 KB of RAM (expandable to 192 KB)instead of ROM BASIC and one or two 8'' F.D. drives. The disk BASIC was automatically loaded into the RAM. Up to 4 independant users could be connected simultaneously. The basic version with a single F.D. drive costed $1964.\r\n\r\n\t\n\n\n",
      "title": "\r\n\t\tCHALLENGER II\r\n\t\t",
      "ROM": "8 KB",
      "NAME": "CHALLENGER II",
      "PRICE": "$598 in assembled form",
      "id": 46,
      "ORIGIN": "U.S.A.",
      "SPEED": "1 or 2 Mhz.",
      "RAM": "4 KB expandable up to 36 KB"
    },
    {
      "PERIPHERALS": "RS-232 card, Centronics card, etc.",
      "CPU": "6502 + 6800 + Z80/8080",
      "YEAR": "1978",
      "image": "ohio_scientific_challengeriii_1",
      "MANUFACTURER": "OHIO Scientific",
      "TYPE": "Professional Computer",
      "OS": "OS-65U, OS-65D, CP/M",
      "BUILT IN MEDIA": "One or two 8'' disk-drives",
      "POWER SUPPLY": "Internal P.S.U.",
      "I/O PORTS": "Expansion slots",
      "description": "\r\nThis computer was an enhanced version of the \nChallenger IIp\n. The motherboard was equipped with 3 microprocessors: 6800, 6502A and Z80. An optional 74 MB harddisk was available ($6000 !).\r\n\n\r\nIt was supplied with a word processor called WP-1 and a database called DMS. An enhanced version of the operating system allowed to connect up to 16 terminals to the computer at one time.\r\n\n",
      "title": "\r\n\t\tCHALLENGER III\r\n\t\t",
      "ROM": "Unknown",
      "NAME": "CHALLENGER III",
      "PRICE": "$3481 with a dual F.D. drive unit",
      "id": 47,
      "ORIGIN": "U.S.A.",
      "SPEED": "1 Mhz / 2 Mhz",
      "RAM": "32 KB (up to 1 MB !)"
    },
    {
      "PERIPHERALS": "Unknown",
      "RAM": "16 KB (up to 64 KB)",
      "BUILT IN LANGUAGE": "Unknown",
      "TEXT MODES": "80 x 24",
      "MANUFACTURER": "Extensis",
      "KEYBOARD": "Unknown",
      "description": "\r\nThe EX3000 Computer, a typical success(?) saga of the early personal computer days.\r\n\n\r\nThe Extensis Corp. EX3000 computer pulled together four emerging technologies; multiprocessor supercomputers, 8 bit microprocessors, the S100 bus standard and multiprocessor, multitasking multiuser operating systems.\r\n\n\r\nThe hardware of the EX3000 system consists of subsystems and boards. Three subsystems were provided :\r\n\n\r\nFOS100 > Floppy disk subsystem (from one to four MB) \n\r\nMTS100 > Multiple terminal system with 8 or more independant RS232c serial interfaces \n\r\nTPS100 > Terminal / Operator Processor Subsystem with keyboard, CRT, RS232c and expanded video attributes.\r\n\n\r\nAnd the following boards were included in the EX3000 :\r\n\n\r\nRM64A    > Memory board with 16 KB RAM \n\r\nMM16     > Memory Management board with bankswitching up to 1 MB. \n\r\nMPU8085  > 8085 Central processor with onboard PROM \n\r\nMPU800   > Optional Z80 CPU with onboard PROM \r\n\n\r\nThe operating system, EMOS, is a multi tasking, multi users operating system which provides memory protection for each user. It can handle the two processors simultaneously. Several languages were developped for this operating system : Extended Basic, Cobol and ANSI Fortran.\n\n\n\n\n",
      "title": "\r\n\t\tEX3000\r\n\t\t",
      "SIZE / WEIGHT": "Unknown",
      "TYPE": "Home Computer",
      "SOUND": "Unknown",
      "ROM": "16 KB",
      "CPU": "8085",
      "GRAPHIC MODES": "Unknown",
      "YEAR": "1977",
      "COLORS": "Unknown",
      "image": "extensis",
      "OS": "EMOS",
      "BUILT IN MEDIA": "None (in standard)",
      "POWER SUPPLY": "Unknown",
      "I/O PORTS": "Several cards (see lower)",
      "PRICE": "Unknown",
      "NAME": "EX3000",
      "id": 48,
      "ORIGIN": "U.S.A.",
      "SPEED": "Unknown"
    },
    {
      "CPU": "6502",
      "GRAPHIC MODES": "None",
      "YEAR": "1977",
      "COLORS": "Monochrome",
      "TEXT MODES": "24 chars. x 24(?) lines",
      "MANUFACTURER": "OHIO Scientific",
      "TYPE": "Home Computer",
      "image": "photos/ohio-scientific_challenger_500.jpg",
      "I/O PORTS": "Tape, Monitor, 1 expansion slot",
      "description": "\r\nThis board was used as a motherboard for the \nChallenger II\n.\n\r\nThree Model 500 versions were sold:\n\n\n500\n: The board.\n\n\n500-1\n: Fully enclosed board with power supply, reset switch and two standard terminal connectors.\n\n\n500-8\n: A 500 board in an eight slot Challenger case with power supply.\n\r\nOHIO Scientific presented later an enhanced version called \nSuperKit\n. It was a 3 board-set with a Model 500 board without the serial interface, a video board, a 8 slot backplane board and a modified version of the BASIC ROM allowing a direct use of the video board. A TV set could be used with an optional RF aerial modulator \r\n\t\n\n\n",
      "title": "\r\n\t\tMODEL 500\r\n\t\t",
      "ROM": "8 KB",
      "NAME": "MODEL 500",
      "PRICE": "Model 500: $298 - SuperKit: $398",
      "id": 49,
      "ORIGIN": "U.S.A.",
      "SPEED": "1 MHz.",
      "RAM": "4 KB"
    },
    {
      "PERIPHERALS": "S-100 Bus cards",
      "RAM": "16 KB (up to 64 KB)",
      "BUILT IN LANGUAGE": "None",
      "TEXT MODES": "80 chars.  x 24 lines",
      "MANUFACTURER": "Northstar",
      "KEYBOARD": "Serial terminal",
      "BUILT IN MEDIA": "One or Two 5.25'' FDD. Later 5 and 18 MB Hard disk drives, 13.4 MB tape backup",
      "CO-PROCESSOR": "None",
      "title": null,
      "SIZE / WEIGHT": "50.8 (W) x 44.4 (D) x 18.4 (H) cm / About 20 kg",
      "TYPE": "Professional Computer",
      "SOUND": "No sound",
      "END OF PRODUCTION": "Unknown",
      "ROM": "1 KB",
      "CPU": "Zilog Z80",
      "GRAPHIC MODES": "Text mode only",
      "YEAR": "1977",
      "COLORS": "Monochrome",
      "image": "photos/northstar_horizon.jpg",
      "VRAM": "Unknown",
      "OS": "Northstar DOS",
      "description": "\r\nThe Horizon was a S-100 bus based system. It was the first floppy-disc based system hobbyists could buy. In a case with a choice of wood or blue metal cover, the basic version included a 4 Mhz. Z80 microprocessor, 16 KB of RAM, a 90 KB 5''1/4 floppy drive with a controller card, a serial terminal interface and 12 S-100 slots. It was sold with the North Star Disc Operating System and a Basic interpreter allowing random and sequential disk files. The Horizon-2 version offered a second floppy-disc drive.\r\n\n\r\nAny S-100 cards (compatible with Altair, Cromemco and many other systems) could be added to the system, but North Star provided its own additional 16 KB RAM and hardware floating point boards.\r\n\n\r\nIn 1979, original 90 KB floppy drives were replaced by Shugart 360 KB models. Northstar also offered an add-on box with two additional floppies, making a total of 4. The box had a matching walnut stained plywood cover.\r\n\n",
      "POWER SUPPLY": "Integrated 250W P.S.U.",
      "I/O PORTS": "12-slot S100 BUS, Serial and Parallel ports",
      "PRICE": "Horizon-1: $1599 (kit)  $1899 (assembled)",
      "NAME": "Horizon",
      "id": 50,
      "ORIGIN": "U.S.A.",
      "SPEED": "4 MHz"
    },
    {
      "PERIPHERALS": "S100 bus cards",
      "RAM": "48.5 KB (512 bytes for CPU + 48KB for S100 bus)",
      "BUILT IN LANGUAGE": "None",
      "TEXT MODES": "64 characters x 16 lines",
      "MANUFACTURER": "Polymorphic",
      "KEYBOARD": "Full-stroke keyboard",
      "description": "\r\nThe Polymorphic System 8813 was the larger brother of the \nPoly 88\n.\r\n\n\n\nWilliam Davis\n reports :\n\n\nThis unit could connected to an add-on unit (MS 88) that consisted of two 8\" Shugart DSDD disk drives. Near the end Polymorphic System also featured a 10 MB hard disk and a unit called the \"Twin Systems\" which allowed two simultaneous users on a shared bus.\r\n\n\r\nI had all the above, buying the first of three 8813 in 1978 and continuing to use it until 1987 when I switched to a series of Kaypro machines. As a last attempt to stay alive Poly tried to market a CP/M based version. I also had one of these which was an unmitigated disaster.\r\n\n\r\nThe software sold by Polymorphic Systems consisted of a Word Processor (very much like the early WordStar), a data base program and their OS.\n\n\n\n\nKyle York\n reports us :\n\n\nIt doesn't use a specific operating system. It could add/extend, delete files but the filesystem was a linked-list. To recover disk space you had to run a utility. Best use was a business-basic package that was incredible.\n\n\n\n\nCharles A Thompson\n reports:\n\n\nwith respect to memory, the Poly was capable of handling 64K -- of which about 8K was for the operating system roms. I have (still have!) several 8813s. One of them has a 48K memory board and an 8K memory board, which placed the upper end of memory at about 56K.\r\n\n\r\nIt took some time for the IBM PC-type of machine to catch up to the capabilities Poly already had when the PC was first introduced (such as subdirectories). Poly could have lengthy file names (up to 32 characters, as I recall, which included any subdirectory names), plus a two-character extension.\r\n\n\r\nI still run several Poly programs, which I significantly wrote, such as General Ledger and Payroll (that is, I got some very crude programs, and rewrote them extensively).\r\n\n\r\nIn addition to their Word Master word processing program, PolyMorphic Systems also sold programs entitled Accounts Receivable, Accounts Payable, Inventory Control, Mailist, Plan (Polymorphic Language for ANalysis), Universal Plotter, and Loan and Investment Analysis. There were probably others -- those are just the ones I have in my collection. Poly also made available a Field Service manual, which contained a significant amount of technical data (I have one of these, also).\r\n\n\r\nMost of the programs were dated 1978, and it's my understanding that these were spruced-up versions of programs originally written for internal purposes by Interactive Products Corporation (aka PolyMorphic Systems).\n\n\n\n\nNick Taylor\n reports:\n\n\nI bought a used Poly 8813 from my friend Stuart Woods, who is now a famous writer, in about 1979.  It came with an IBM Selectric typewriter that had been converted to a printer and sat atop a massive cabinet full of wires.  Its WordMaster word processor was the best around at the time, but the only tech support came from other PolyMorphic users.  One of these was Mark Sutherland, Atlanta's resident PolyMorphic genius, whom I bothered on an almost daily basis.  I was still using the Poly when I moved to New York in 1984, and found a fanatic Poly user on Long Island whose name I don't recall, but who was kind enough to answer my usually dense questions.  He was using Polys and WordMaster to produce newsletters including one for Poly users, and continued to do so into the late 1980s.  I produced my first book, Bass Wars, on the Poly but the support problems became too much for me to overcome.  I sold my Poly for parts to the fellow on Long Island and switched to PCs, but I remember it fondly, kind of like a difficult love relationship.\n\n\n\n\n",
      "title": "\r\n\t\tSystem 8813\r\n\t\t",
      "SIZE / WEIGHT": "About 6 kg (main unit)",
      "TYPE": "Professional Computer",
      "SOUND": "Unknown",
      "END OF PRODUCTION": "Unknown",
      "ROM": "3 KB (monitor)",
      "CPU": "Intel 8080A",
      "GRAPHIC MODES": "128 x 48 using block-graphics",
      "YEAR": "1977",
      "COLORS": "Monochrome",
      "image": "photos/pub_polymorphic.jpg",
      "OS": "Polymorphic OS",
      "BUILT IN MEDIA": "5.25'' disk-drives",
      "POWER SUPPLY": "Built-in power supply unit",
      "I/O PORTS": "S100 Bus",
      "PRICE": "Unknown",
      "NAME": "System 8813",
      "id": 51,
      "ORIGIN": "U.S.A.",
      "SPEED": "2 MHz 8080A, running at 1.8432 MHz (so that it could be easily divided to produce standard baud rate clocks)"
    },
    {
      "RAM": "1 MB DRAM + 1 MB Flash RAM (holds Operating System and built-in software)",
      "BUILT IN LANGUAGE": "None",
      "TEXT MODES": "Bitmapped characters",
      "MANUFACTURER": "Amstrad",
      "KEYBOARD": "Full-stroke keyboard, PC-AT type",
      "BUILT IN MEDIA": "One 1.44 MB 3.5'' disk-drive",
      "CO-PROCESSOR": "Winbond 83787 I/O chipset",
      "title": "\r\n\t\tPCW 16\r\n\t\t",
      "SIZE / WEIGHT": "35.5 (H) x 30 (D) x 31 (W) cm (main unit)",
      "TYPE": "Professional Computer",
      "SOUND": "1 channel",
      "ROM": "Unknown",
      "CPU": "Zilog Z80 A",
      "GRAPHIC MODES": "640 x 480 dots",
      "YEAR": "1994",
      "COLORS": "Monochrome built-in display",
      "image": "photos/Amstrad_PCW16_Running_s1.jpg",
      "OS": "Roseanne + CP/M 2.2",
      "description": "\r\nThe PCW 16 replaced the \nPCW 9512\n. Contrary to the previous models, which used a text-based interface, the PCW 16 used a graphical user interface called The Desktop. The computer didn't run CP/M like the old PCW computers, but had its own operating system called Roseanne. Even though CP/M wasn't supplied, it was adapted to this machine by independent developers. \r\n\n\r\nUnlike the previous PCW models which came with only the Locoscript word-processor, the PCW16 came with a complete range of built-in software - word-processor, spreadsheet, address book, diary/alarm, calculator and file manager.\r\n\n\r\nLuckily, Amstrad abandoned the Hitachi 3\" floppy format and switched to the standard MSDOS 3.5\" 1.44 MB double-density floppy disk. The Roseanne system could use long filenames (up to 31 characters). The display was also standard: 640 x 480 VGA mode.\r\n\n\r\nAmstrad provided Several internal expansions for the PCW-16, 1 MB RAM, 2 MB Flash RAM, Application ROMs, second FDD drive; but it seems that none of them saw the light. \r\n\n",
      "POWER SUPPLY": "Power supply built-in",
      "I/O PORTS": "Serial & Parallel Ports, Serial mouse, AT keyboard",
      "PRICE": "£299 when it came out",
      "NAME": "PCW 16",
      "id": 52,
      "ORIGIN": "United Kingdom",
      "SPEED": "16 MHz"
    },
    {
      "RAM": "2 x 64 KB",
      "BUILT IN LANGUAGE": "Basic interpreter and Turbo Pascal compiler were available as add-on programs",
      "TEXT MODES": "80 x 26",
      "MANUFACTURER": "Iskra Delta",
      "KEYBOARD": "Full-stroke keyboard with numeric keypad",
      "CO-PROCESSOR": "None",
      "title": "\r\n\t\tPARTNER\r\n\t\t",
      "TYPE": "Professional Computer",
      "description": "\r\nThe computer has an integrated monitor and separated keyboard. It was used as main business computer in Slovenia and also in schools, standing next to \nCommodore C64\n and \nSinclair ZX Spectrum\n series; and normally equipped with Turbo Pascal 3.x and Wordstar.\r\n\n\r\nIskra Delta was one of the biggest producers of computer systems in former Yugoslavia. Their systems could be found in almost all large companies in Yugoslavia where they were able to connect to VAX/VMS and IBM systems.\r\n\r\n\n",
      "SOUND": "Unknown",
      "ROM": "4 KB",
      "CPU": "Zilog Z80 A",
      "GRAPHIC MODES": "Unknown",
      "YEAR": "1983",
      "COLORS": "12'' monochrome monitor",
      "image": "photos/iskra-delta_partner_1.jpg",
      "OS": "CP/M Plus (version 3.0), MP/M (multi-tasking version of CP/M).",
      "BUILT IN MEDIA": "5.25'' disk-drive",
      "POWER SUPPLY": "Built-in Power Supply Unit",
      "I/O PORTS": "RS232 C (1200, 2400 or 4800 bauds, used for printer) + 2 RS232-C (300 - 9600 bauds)",
      "PRICE": "Unknown",
      "NAME": "PARTNER",
      "id": 53,
      "ORIGIN": "Yugoslavia",
      "SPEED": "4 MHz"
    },
    {
      "CPU": "Unknown 16Bit",
      "GRAPHIC MODES": "Unknown",
      "YEAR": "1984",
      "BUILT IN MEDIA": "FDD & Hard Disk (?)",
      "TEXT MODES": "Unknown",
      "MANUFACTURER": "Iskra Delta",
      "TYPE": "Professional Computer",
      "OS": "DELTA / M",
      "CO-PROCESSOR": "Unknown",
      "image": "photos/iskra-delta_800_1.jpg",
      "SOUND": "Unknown",
      "I/O PORTS": "RS232 and ... ?",
      "description": "\r\nIskra DELTA 800 was derived from the Digital PDP-11/34, compatible to the DELTA family. It could be connected to other computer systems like DEC, IBM, UNIVAC, and others.\r\n\n\r\nIt had extended addressing capability (hence, could support 4 MB of RAM), was running somewhat modified RSX 11M, called Delta M OS, and ran J11 Digital Equipment processor (as all PDPs 11 did).\r\n\n\r\nThere were several programming languages written for its operating system: ASSEMBLER, COBOL, FORTRAN, BASIC and PASCAL. Iskra Delta was one of the biggest producers of computer systems in former Yugoslavia. Their systems could be found in almost all large companies in Yugoslavia.\r\n\n\n\nMore info needed!\n\r\nThanks to Delimir Purgar and Bostjan Lemut for some info.\r\n\r\n\t\n\n\n",
      "title": "\r\n\t\t800\r\n\t\t",
      "ROM": "4 KB",
      "NAME": "800",
      "PRICE": "Unknown",
      "id": 54,
      "ORIGIN": "Yugoslavia",
      "SPEED": "Unknown",
      "RAM": "Up to 4 MB"
    },
    {
      "CPU": "Motorola 68B09",
      "GRAPHIC MODES": "Unknown",
      "YEAR": "1982",
      "COLORS": "Unknown",
      "TEXT MODES": "Unknown",
      "MANUFACTURER": "South West Technical Products Corporation",
      "TYPE": "Professional Computer",
      "OS": "Uniflex",
      "CO-PROCESSOR": "Unknown",
      "image": "photos/sws.jpg",
      "SOUND": "Unknown",
      "I/O PORTS": "Unknown",
      "BUILT IN MEDIA": "Early versions had dual 8",
      "description": "\n\nThe information of this page comes from \nRichard Allen\n.\n\n\n\r\nThe S-PLUS was manufactured by SouthWest Technical Products who started with \"kit built\" computers in the back of Mechanics Illustrated.   In 1982 they came out with the S-Plus system primarily for small businesses.\r\n\n\r\nUtilizing Motorola's 68B09, the 2mhz version of the same chip that powered the Radio Shack Color computer, and the SS-50 bus they reached an agreement with Technical Systems Consultants of NC to provide a multi-user processing system based on a more user friendly sub-set of Unix called UniFLEX.\r\n\n\r\nThe 68B09 was a 8/16 bit computer. Internal process was done in 16 bits, but bus I/O was still 8 bits.  Memory came in 250K boards, the bus could accommodate 4 boards, however, because of hardware I/0 address conflicts, only 750K could be accessed as RAM.\r\n\n\r\nThe UniFLEX operating system allocated up to 64K to each task (running program) and when operated in multi-user mode, made use of memory swapping to the HD for virtual memory.\n\r\nWhile bus configuration allowed up to 18 serial ports, in reality, only 6-10 ports configured as multi-user was practical.  If the application was CPU or I/O intensive, then that number might be reduced to 2 or 3 active users.\r\n\n\r\nEarly versions had dual 8\" Floppy Drives 20 MB Seagate hard drives, but later versions used up to 2 40 MB ATASI drives through a Western Digital Controller. A Streaming Tape was also available.\r\n\n\r\nThe UniFLEX operating system was a dream, patterned after UNIX but with easier, more english language like commands emulated their Unix counterparts. commands like makdir, copy, list, find, search.  Basic, Compiled Basic, Fortran 77, Cobol (patterned after Data Generals with VSAM files and a screen section).\n\r\nIt had a printer spooler that had features that most don't have even today.\r\n\n\r\nWhy did it not become popular.  My option is that the primary problem was lack of trust between the hardware manufacturer and the operating system supplier. Having dealt with both sides as president of the Users Group I found both sides to be paranoid about sharing information with each other.\n\r\nAs a result, hardware/software development was slow, and with a lot of finger pointing.  While it was marketed it as a business solution, they only developing programming and systems software, no applications.\n\r\nA few attempts were made by third parties to develop a spread sheet loosely based on VisiCalc, and word processor but no organized effort was made to develop an overall office solution.\r\n\t\n\n\n",
      "title": "\r\n\t\tS-PLUS\r\n\t\t",
      "ROM": "Unknown",
      "NAME": "S-PLUS",
      "id": 55,
      "ORIGIN": "U.S.A.",
      "SPEED": "2 MHz",
      "RAM": "Unknown"
    },
    {
      "PERIPHERALS": "All the Apple II cards and peripherals",
      "RAM": "64 KB",
      "BUILT IN LANGUAGE": "Applesoft BASIC",
      "TEXT MODES": "40 x 24",
      "MANUFACTURER": "Franklin",
      "KEYBOARD": "Typewriter type - 71 keys with numeric keypad",
      "description": "\r\nThe Franklin ACE 1000 was launched in 1983. It was the successor of the \nACE 100\n, released in 1981. The ACE 1000 had 48 KB RAM and allowed for a 16 KB Language card. It also supported lower-case letters, had a numeric keypad, and a larger case. \r\n\n\r\nFrom the factory, the Ace-1000 did not support colours but there was a colour chip that could be added by the dealer for $50 (this dealer add-on was an attempt to protect themselves legally against lawsuits from Apple). \r\n\n\r\nIt was fully compatible with the \nApple II\n and could use the same programs and cards. Unlike the Apple II, the Franklin didn't have tape recorder In/Out jacks but its power supply had an integrated cooling fan.\r\n\n\r\nThe makers of this computer would be sued in 1984 for violation of certain Apple trademarks, namely, the operating system. Apple would win the lawsuit, and Franklin would be forced out of the computer business.\r\n\n\r\n__________\r\n\n\n\nMatt Beechey\n recalls :\n\r\nThe most annoying thing about the design of this computer was it had a reset button under the front edge - I used to always lift my legs up onto the rest of the chair and hit the reset button with my knee after hours of unsaved typing!\n\n\n\n\n",
      "title": "\r\n\t\tACE 1000\r\n\t\t",
      "SIZE / WEIGHT": "45 (W) x 49.8 (D) x 11 (H) cm",
      "TYPE": "Home Computer",
      "SOUND": "1 voice - Built-n speaker",
      "ROM": "12 KB",
      "CPU": "6502",
      "GRAPHIC MODES": "40 x 48 / 208 x 160 / 280 x 192",
      "YEAR": "1982",
      "COLORS": "monochrome",
      "image": "photos/Franklin_ACE1000_System_s1.jpg",
      "OS": "Apple DOS",
      "BUILT IN MEDIA": "None",
      "POWER SUPPLY": "Built-in switching PSU with cooling fan",
      "I/O PORTS": "Joystick, 8 Apple II compatible slots",
      "PRICE": "$1,100",
      "NAME": "ACE 1000",
      "id": 56,
      "ORIGIN": "U.S.A.",
      "SPEED": "1.022 mHz"
    },
    {
      "PERIPHERALS": "Second digital data-pack drive, 5''1/4 disk-drive, modem, 64k RAM expansion",
      "RAM": "64 kb (25 kb available with Smart Basic), upgradable to 144 kb",
      "BUILT IN LANGUAGE": "SmartWriter wordprocessor, Smart BASIC delivered on data-pack",
      "TEXT MODES": "40 x 24 / 36 x 24",
      "MANUFACTURER": "Coleco",
      "KEYBOARD": "Full-stroke keyboard with separated arrow keys, ten command keys and six programmable function keys. 75 keys",
      "BUILT IN MEDIA": "1 - Digital data pack reader (real to real magnetic tape encased in a Lexan cassette), 256 KB. There is a room for an optional second one",
      "CO-PROCESSOR": "6801 Master-microcomputer",
      "title": "\r\n\t\tADAM\r\n\t\t",
      "TYPE": "Home Computer",
      "SOUND": "3 voices, 5 octaves",
      "END OF PRODUCTION": "1985",
      "ROM": "32 kb",
      "CPU": "Zilog Z80 A",
      "GRAPHIC MODES": "256 x 192",
      "YEAR": "June 1983",
      "COLORS": "16",
      "image": "photos/coleco_adam.jpg",
      "VRAM": "16 kb",
      "OS": "EOS (Elementary Operating System) / OS-7",
      "description": "\r\nThe ADAM is available in two models, the complete system and Expansion Module #3. When the memory console of Expansion Module #3 is connected to the ColecoVision, the two models are essentially identical in function. The unit pictured here is the expasion module #3 (it is shorter than the complete unit). The expansion module #3 uses part of the Colecovision hardware, thus the memory unit doesn't have any cartridge slot, and isn't delivered with any controllers nor TV switch box.\r\n\n\r\nThe whole system is made of the daisywheel printer, the memory unit and the keyboard. The power supply is built-in the printer!\r\n\n\r\nThe Smart Basic isn't in ROM and has to be loaded from a tape, however there's a little word processor in ROM, this word processor prints the text to the printer at the same time the user types on the keyboard, but can also be used as a classic wordprocessor.\r\n\n\r\nThe Adam had a pretty short life, only two years! Despite this there is still a community of Adam fans who still use their system. Nowadays, most Adam users use a 320k 5 1/4 inch disk drive, an external 2400 baud modem, and a 20, 30 or 40 megabyte IDE harddisk. Adams often have memory expanders up to 2 MB in size (which is usually used as a RAM disk), and also a parallel printer (like a bubble jet)!\r\n\n\r\nGreg Bowman reports that he got an external CD drive for his Adam from his uncle who was then Vice President of Coleco. He notices that this CD drive was designed especially for the Adam. If anyone has more information about this CD drive, don't hesitate to mail us.\n\n\n\n\n",
      "POWER SUPPLY": "Built-in the printer !",
      "I/O PORTS": "Cartridge slot (complete system only), RGB video out, 2 x Joystick sockets, expansion port, 2 x ADAMNET port (serial port used to connect printer, digital tapes and keyboard), 3 x card connectors inside the case",
      "PRICE": "$700 (USA, 1983)",
      "NAME": "ADAM",
      "id": 57,
      "ORIGIN": "U.S.A.",
      "SPEED": "4 mHz"
    },
    {
      "RAM": "4 KB (up to 32 KB of static RAM)",
      "BUILT IN LANGUAGE": "Optional Basic ROM",
      "TEXT MODES": "1 line of 20 chracters (LED screen)",
      "MANUFACTURER": "Rockwell",
      "KEYBOARD": "Full-stroke keyboard",
      "description": "\r\nThis strange computer was designed to be a development system for 6502 based computers. It had no display except for a small 20 character LED screen and a very small thermal printer located directly on the motherboard which could print everything that was typed on the keyboard.\r\n\n\r\nThe board featured five 4 KB-ROM sockets. Two of them were dedicated to the AIM monitor program, including an instant input assembler (no labels) and a disassembler. Various programming languages (BASIC, FORTH...) or custom applications could be added in the three remaining sockets.\r\n\n\r\nSeveral cards were developped for this machine, especially language cards and ROMs: a BASIC card (BASIC language with floating point mathematics capabilities), PL/65 (a mixture of the PL/1 and Algol languages), Instant Pascal (an interpreted version of Pascal), Assembler and the FORTH programming language.\r\n\n",
      "title": "\r\n\t\tAIM 65\r\n\t\t",
      "SIZE / WEIGHT": "Unknown",
      "TYPE": "Home Computer",
      "SOUND": "None",
      "END OF PRODUCTION": "Unknown",
      "ROM": "12 KB",
      "CPU": "Rockwell 6502",
      "YEAR": "1976",
      "image": "photos/rockwell_aim65_r-side_s.jpg",
      "POWER SUPPLY": "Needs four power supply voltages: +5v, +12v, -12v, and +24v for the printer",
      "I/O PORTS": "Application bus, expansion bus, ROM connector",
      "PRICE": "$375",
      "NAME": "AIM 65",
      "id": 58,
      "ORIGIN": "U.S.A.",
      "SPEED": "1 MHz"
    },
    {
      "RAM": "128 KB",
      "BUILT IN LANGUAGE": "Unknown",
      "TEXT MODES": "80 x 24 / 128 x 24",
      "MANUFACTURER": "MBC",
      "KEYBOARD": "Full stroke keyboard with numeric keypad",
      "BUILT IN MEDIA": "2 x 5.25'' disk-drives",
      "CO-PROCESSOR": "Unknown",
      "title": "\r\n\t\tALCYANE A6E\r\n\t\t",
      "SIZE / WEIGHT": "Unknown",
      "TYPE": "Professional Computer",
      "SOUND": "Unknown",
      "END OF PRODUCTION": "Unknown",
      "ROM": "4 KB",
      "CPU": "Intel 8085",
      "GRAPHIC MODES": "256 x 256",
      "YEAR": "1983",
      "COLORS": "monochrome",
      "image": "photos/mbc_alcyane_a6e_1.jpg",
      "OS": "Alcybase, French OS and language, optional CP/M",
      "description": "\r\nThe Alcyane had a very powerful basic for files managing called Alcybase. It could use a specific version of APL. It was possible to network 2 to 4 computers together.\n\r\nThe manufacturer was MATRA DATASYSTEM (until 1986)\r\nThese computers where mainly sold with 10 MB removable 12\" hard disks from CII Honneywell Bull.\n\r\nA multi-user system was also released, called \nA10\n.\r\n\n\r\nJean Pierre Bouhot was one of the founders of MBC. The C letter came from COTTIN who went into partnership with Bouhot.\n\r\nInitial planned company name was MBI, anagram of IBM with the slogan \"L'informatique à l'envers\" (computing backwards).\n\r\nBouhot also created the French magazine \"L'informatique professionnelle\" which is still alive and is now property of Gartner Group through his 1997 aquisition of \"Bouhot & Le Gendre\" consulting French Cie.\r\n \r\n\r\n\t\n\n\n",
      "POWER SUPPLY": "Built-in power supply unit",
      "I/O PORTS": "10 expension slots",
      "PRICE": "5350 ",
      "NAME": "ALCYANE A6E",
      "id": 59,
      "ORIGIN": "France",
      "SPEED": "5 mHz"
    },
    {
      "PERIPHERALS": "Printer, 16k RAM expansion",
      "RAM": "Alice 4k : 4 kb, 3 kb left for user",
      "BUILT IN LANGUAGE": "Basic Microsoft 1.0 (1982)",
      "TEXT MODES": "Alice 4k : 32 x 16",
      "MANUFACTURER": "Matra Hachette",
      "KEYBOARD": "AZERTY, chicklet keyboard",
      "CO-PROCESSOR": "MC-6847 Video Generator",
      "title": null,
      "SIZE / WEIGHT": "51 x 216 x 178 / 850gt",
      "TYPE": "Home Computer",
      "SOUND": "1 channel",
      "END OF PRODUCTION": "Alice 4k : 1982",
      "ROM": "Alice 4k : 8 kb",
      "CPU": "Motorola 6803 (a cross between 6800 and 6809)",
      "GRAPHIC MODES": "Alice 4k : 64 x 32",
      "YEAR": "1983",
      "COLORS": "Alice 4k : 9",
      "image": "photos/matra_alice_top.jpg",
      "description": "\r\nAs the \nSinclair ZX-81\n, the Alice was clearly marketed as an initiation machine.\r\n\n\r\nIn 1981, Matra signed a deal with Tandy/RadioShack to develop a \nMC-10\n clone for 1983 : the Alice. Matra then worked with Hachette (both were owned by the Lagardère group) to produce the documentation and to organize the distribution. Last but not least, the well known and excellent french illustrator Moebius drew a beautiful illustration for the docs and the box of the Alice.\r\n\n\r\nAlice is quite limited in its possibilities but is also quite pleasant to use. Its case is whole red and the computer really looks like a toy.\r\n\n\r\nSeveral educational programs were developed for this computer.\r\n\nThen in 1984, Matra presents a new version : The Alice 32 with 16 kb RAM and improved graphical possibilities.\r\n\n\r\nBut this computer was, like the MC 10, a flop in the marketplace. It was replaced one year later by the \nAlice 90\n.\n\n\n\n\n",
      "POWER SUPPLY": "10v  - 1,3A",
      "I/O PORTS": "Expansion port (18 pins)",
      "PRICE": "182 ",
      "NAME": "ALICE",
      "id": 60,
      "ORIGIN": "France",
      "SPEED": "0.89 MHz"
    },
    {
      "PERIPHERALS": "Printer",
      "RAM": "32 KB",
      "BUILT IN LANGUAGE": "Microsoft Color Basic 1.0",
      "TEXT MODES": "32 x 16 / 40 x 25 / 80 x 25",
      "MANUFACTURER": "Matra Hachette",
      "KEYBOARD": "AZERTY full-stroke keyboard, arrow keys",
      "CO-PROCESSOR": "EF 9345 Video Generator",
      "title": "\r\n\t\tALICE 90\r\n\t\t",
      "SIZE / WEIGHT": "365 x 205 x 70 mm / 1,1Kg",
      "TYPE": "Home Computer",
      "SOUND": "1 channel 3 octaves",
      "ROM": "16 KB",
      "CPU": "Motorola 6803",
      "GRAPHIC MODES": "64 x 32 / 80 x 50 (8 colors) / 160 x 125 (3 colors) / 320 x 250",
      "YEAR": "1984",
      "COLORS": "8",
      "image": "photos/matra_alice90_1_hr_s.jpg",
      "VRAM": "8 KB",
      "description": "\r\nThe Matra Alice 90 is the successor of the unsuccessful \nAlice 32\n and is 100% compatible with this computer. This computer was designed, like its predecessor, to be used as a \"first contact\" computer.\r\n\n\r\nGenlocking allowed the user to use the computer and watch TV simultaneously.\r\n\n\r\nThe ROM contains a version of the world famous Microsoft BASIC, but this version of BASIC can't access to the highest graphic mode (320x250), it could be accessed from the built-in assembler. \r\n\n\r\nLike its predecessor, this machine was also unsuccessful.\r\n\t\n\n\n",
      "POWER SUPPLY": "10v CA, 1.3A (MC-10 and Alice PSU can be used)",
      "I/O PORTS": "RGB video out, Expansion port, Tape, Serial port",
      "PRICE": "380",
      "NAME": "ALICE 90",
      "id": 61,
      "ORIGIN": "France",
      "SPEED": "4 MHz"
    },
    {
      "CPU": "Intel 8080A (rarely 8080)",
      "GRAPHIC MODES": "None",
      "YEAR": "1975",
      "image": "photos/mits_altair-8800_2.jpg",
      "TEXT MODES": "None (optional 64 x 12 card)",
      "MANUFACTURER": "MITS",
      "TYPE": "Professional Computer",
      "KEYBOARD": "No keyboard, but switches on front panel.",
      "POWER SUPPLY": "Unknown",
      "I/O PORTS": "Unknown",
      "description": "\r\nThis computer was one of the first \"home\" computers ever made, it was sold as a kit, but for additional money, you could buy one fully assembled.\r\n\n\r\nIt had no keyboard, the \"program\" had to be entered with the switches located on the front panel of the \"computer\", and as it didn't have video output (yet), the result was displayed via LEDs.\r\n\n\r\nAnother computer which had almost the same characteristics was launched by IMSAI and was called \nIMSAI 8080\n (see both in the \"Emulators\" section). \r\n\n\r\nThe ALTAIR 8800 had one input port, also called the \"Sense Switches\" (I/O address 255) which was the left hand 8 address switches. Address 255 was also used on the IMSAI. The IMSAI front panel differed from the Altair in that you could also output to port 255 to a displayed LED buffer above the sense switches - a feature the Altair did not have (it only had input).  The Altair sense switch were used during boot into Altair DOS to specify the terminal port to the DOS.\r\n\n\r\nMITS made several peripherals and cards for this computer, namely, a video card, a serial card to connect a terminal, a RAM expansion card and a 8\" floppy drive that used hard sectored floppies and stored 300 KB.\r\n\n\r\nSeveral models were launched, they had the same characteristics except the CPU (8080 and later 8080A).\r\n\n\r\nBelieve it or not, the name \"Altair\" comes from Star Trek! The young daughter of the 'Popular Electronics' magazine editor gave it the name of the destination planet of the Enterprise from the episode she was watching.\r\n\n\n\n\n\n",
      "title": "\r\n\t\tALTAIR 8800\r\n\t\t",
      "SIZE / WEIGHT": "Unknown",
      "ROM": "None",
      "NAME": "ALTAIR 8800",
      "PRICE": "$595",
      "id": 62,
      "ORIGIN": "U.S.A.",
      "SPEED": "2 MHz (each instruction takes 4 clock cycles)",
      "RAM": "256 bytes (you had to buy this memory board)"
    }
  ]
}